[{"path":"/Articles/Gods/Ilmatera.md","content":"The goddess Ilmatera embodies endurance and martyrdom, serving as a divine patron for the suffering and oppressed. Known for her selfless nature, she willingly bears others' burdens and pain, with legends suggesting she would take on all the world's suffering if possible. She holds a particular affinity for those facing persecution and encourages both endurance in the afflicted and assistance from others.\n\nDuring the events of the Ghosts of the Sea, Ilmatera appeared to [[Nilo]] under the guise of Illira and provided aid to the party in their confrontation with [[Umberlee]]."},{"path":"/Articles/Gods/Lathender.md","content":""},{"path":"/Articles/Gods/Umberlee.md","content":"In the seas of Amaterra lurks an ancient evil - Umberlee, the Queen of the Depths, though she's more commonly known to sailors as the Bitch Queen. While most gods have faded from the world's memory, her malevolent influence continues to manifest in nature itself. Sailors and seafarers still whisper her name in fear, offering prayers not out of devotion, but desperate hope to appease her destructive whims.\n\nStories tell of her supernatural powers over weather and sea creatures, who bow before her might. Those fortunate enough to survive encounters with her all share the same description - a deranged and malicious entity who delights in chaos. Her reputation as the Bitch Queen is well-earned; she is known for her pettiness, greed, and vanity, drowning ships and their crews on mere caprice.\n\nHer true nature was exposed during the events of The Ghosts of the Sea, where she had been disguising herself as \"Emberlee,\" sabotaging expeditions and causing maritime disasters for her own amusement. Despite the world's general loss of faith, Umberlee stands as a dark reminder that some ancient powers still hold sway over the realms of [[Amaterra]], and her infamous title continues to be whispered with fear across every port and vessel.\n"},{"path":"/Articles/NPCs/Crew Members/Durim Stonehammer.md","content":"Durim serves as the leader carpenter of the [[Fulh'ulbrech]], where his gruff dwarven demeanor matches his obsessive dedication to the ship's maintenance. When not scrutinizing every wooden detail of the vessel, he can typically be found enjoying strong drink. He holds traditional women—particularly non-elven relatives—in high regard."},{"path":"/Articles/NPCs/Crew Members/Grommash Thunderfist.md","content":"Grommash is a mark of the storm [[Dragonmark|dragonmark]] half-orc. Born on [[Yomel]] from her warrior mother and his human father who has a fisherman. He firmly believes that it's his destiny to conquer the seas. Mysteriously the main helmsman of the [[Fulh'ulbrech]], although he has no talent to navigate and has shipwrecked many ships on his way to [[Imia]]. Before coming to the [[Fulh'ulbrech]] he met with [[Private/Primal Era Campaign/Private/PCs/Herng Azurit|Herng]] when leaving [[Yomel]] and they soon added [[Gio]] to their misadventures after meeting him in a tavern. He has been missing from the party ever since their arrival in [[Public/Articles/Story Events/The Isle of Whispers]]. Being expelled by [[Quill Rest]]  during the[[Grommash’s Incident]]."},{"path":"/Articles/NPCs/Crew Members/Marisella.md","content":"Marisella, a half-elf cleric of [[Lathender]] and healer of the [[Fulh'ulbrech]], was eventually revealed to be the daughter of [[Lathender]] during the events of [[Harpy's Sincerity]]. Her faith came to light during [[The Ghosts of the Sea]]. Her ambitious dreams included becoming one of the strongest adventurers while repopulating the planet with children of her faith. Though she met her end at the hands of [[Mu Youqing]] during [[Team Magma's Journey]], she was later revived during the events of [[The Surgery]]."},{"path":"/Articles/NPCs/Crew Members/Rudy Blagsta.md","content":"Rudy is a hobgoblin fisherman from the [[Fulh'ulbrech]]. After surviving the events of [[The Ghosts of the Sea]], he followed the party to the [[Isle of Whispers]] where he joined the [[Lluvia Tribe]]'s fisher guild to earn his own fortune."},{"path":"/Articles/NPCs/Divine Generals/The Goat.md","content":"The Goat, one of the [[Divine Generals]], was the first to join the adventuring party. Distinguished by his white fur and remarkably human-like demeanor, this peculiar being exhibits highly unusual dietary preferences for his species—eschewing typical goat fare in favor of an exclusively carnivorous diet, with a particular predilection for organs over mere flesh.\n\nReserved in nature, the Goat operates with a striking independence that often leads to complications. His tendency to act without consulting others and failure to communicate his intentions have frequently resulted in difficulties for his companions."},{"path":"/Articles/NPCs/Former Crew Members/Griznak.md","content":"Griznak was a bugbear who served as first mate aboard the [[Fulh'ulbrech]]. He was discovered dead on the lower deck in the aftermath of [[The Ghosts of the Sea]]."},{"path":"/Articles/NPCs/Former Crew Members/Satlypaws.md","content":"Captain of the [[Fulh'ulbrech]]. [[Eldon Deunwise]]'s best friend. Presumably dead by a severe thorax injury and several drownings."},{"path":"/Articles/NPCs/Former Crew Members/Silverscale.md","content":"A little Kobold with silver scales. Sailmaster of the [[Fulh'ulbrech]]. He believes that he will awaken the powers of his ancestors. Being a powerful and big red dragon. Silverscale went to bully the [[Gio]] when he was imprisoned for murder. He was sent flying during the night of [[The Ghosts of the Sea]]. His destiny unknown."},{"path":"/Articles/NPCs/Former Crew Members/Sylva Windwhisper.md","content":"An Aarakocra lookout of the [[Fulh'ulbrech]]. She went missing after she tried to save her little companion [[Silverscale]] from being send flying from the deck on the night of the [[The Ghosts of the Sea]]."},{"path":"/Articles/NPCs/Former Crew Members/Thistle.md","content":"Thistle was a gnome navigator. He was the lead navigator of the [[Fulh'ulbrech]]. Acquaintance with [[Public/Articles/PCs/Laura Cassini|Laura]]'s father, he decided to let her in the expedition and take her as an apprentice. His genius to study the stars lead him to a very valuable revelation. A formula capable of predicting the movements of those objects in the heavens. He died abruptly during the same day he predicter a [[The Fateful eclipse|lunar eclipse]]. The stabber's identity remains unknown."},{"path":"/Articles/NPCs/Former Crew Members/Vexa.md","content":"She was an alluring red Tiefling swashbuckler and the gunner of the [[Fulh'ulbrech]]. She lied in her application but still got the job, which caused multiple accidents along their journey. She always pushed her responsibilities to those more unfortunate than her, like [[Nilo]]. She interrogated the party while they were imprisoned for murder. Presumably dead after being dragged to the depths of the ocean during [[The Ghosts of the Sea]] events."},{"path":"/Articles/NPCs/Imia/Eldon Deunwise.md","content":"Magnate, proud owner of [[Satlypaws]] and the guy who paid for the [[Fulh'ulbrech]]."},{"path":"/Articles/NPCs/Phudara/Harpy.md","content":"The [[Harpy]] is a capricious fey creature whose presence has been intertwined with the party since their arrival at the [[Isle of Whispers]]. Her nature manifests in a chaotic blend of mischief and near-tyrannical impulses, making her an unpredictable force in any situation.\n\nMost notably, she played a pivotal role in reviving [[Public/Articles/PCs/Herng Azurit|Herng]] during the events of [[The Incels]]—a decision she would come to regret, leading her to petition [[Gio]] to reverse the resurrection and return him to his state as a tart.\n\nThe true extent of [[Harpy]]'s powers was unveiled during [[Harpy's Sincerity]], when [[Public/Articles/PCs/Herng Azurit|Herng]] witnessed her extraordinary capabilities firsthand. Her might was demonstrated through her ability to freely manipulate and exhort an avatar of the god [[Lathender]]—a feat that revealed the true scope of her supernatural influence and power.\n\nWithin the [[The Shadow Sect|Shadow Sect]], Harpy has carved out a distinctive position as a self-proclaimed saintess. In this role, she takes on the dual responsibilities of talent scout and island supervisor, identifying potential recruits while maintaining oversight of the isle's activities."},{"path":"/Articles/NPCs/Phudara/Tribe Espora/Zarvon Fungart.md","content":"[[Zarvon]], sovereign of the [[Tribe Espora]], stands at the pinnacle of cultivation on the island, though his mind has long since begun to fracture. A former chosen of the trials of fire, his current mastery over spores brings terror to many, as rumors persist of his ability to control the minds of those who inhale them—a threat magnified by his capacity to spread these spores across the entire island. Once a figure of calculated authority, his behavior now swings wildly between lucidity and madness. In his declining years, he has focused his remaining clarity on doting upon his granddaughter [[Laura Bush]], perhaps seeking to preserve some fragment of his former self through her."},{"path":"/Articles/NPCs/Phudara/Tribe Llamarada/Morwen Darm.md","content":"Morwen stands as the supreme elder of the [[Tribe Llamarada]], serving as their second pillar of fire. Following the death of her husband [[Gaeanor Darm]], the former pillar of earth, in a tragic incident at the [[Infernoheart Citadel]], she assumed the honorary title of fire pillar despite only reaching the quasi-nascent soul realm. Through [[Talon Scorch]]'s guidance, she attained the power necessary to shoulder the tribe's need for a supreme elder. In the wake of these events, her daughter [[Rachel Darm]] ascended as the tribe's holy daughter, while Morwen herself grew more cold and reserved, her warmth diminished by the loss of her husband."},{"path":"/Articles/NPCs/Phudara/Tribe Llamarada/Oxitee.md","content":"[[Oxitee]], an elven warrior of the [[Tribe Llamarada]], shared his sister's tragic destiny. After leading [[Nilo]] and [[Marisella]] to their tribe alongside her, he too perished at [[Nilo]]'s hands during the trial of fire."},{"path":"/Articles/NPCs/Phudara/Tribe Llamarada/Rena.md","content":"A young elven initiate of the [[Tribe Llamarada]] met her fate during the sacred trial of fire. Together with her brother [[Oxitee]], she had guided [[Nilo]] and [[Marisella]] to her tribe, only to fall by [[Nilo]]'s hand during the ritual."},{"path":"/Articles/NPCs/Phudara/Tribe Llamarada/Talon Scorch.md","content":"Talon Scorch, the eldest member of the [[Tribe Llamarada]], once led the tribe as its patriarch and primary pillar of fire. A chosen survivor of the trial of fire, his triumph elevated him to legendary status within the tribe. Though he has since passed the mantle of leadership, he continues to share the responsibilities of the fire pillar with [[Morwen Darm]], his influence and renown undiminished by time."},{"path":"/Articles/NPCs/Phudara/Tribe Llamarada/Thornor Bramblehelm.md","content":"Thornor, patriarch of the [[Tribe Llamarada]], stands as a master of metallurgic martial arts. Though long resigned to his fate, his diligent cultivation never wavered. Now, as calamity looms on the horizon, he races desperately toward a breakthrough that might ensure his survival and those of his tribe. He was interested in the foreign martial arts of [[Gio]]."},{"path":"/Articles/NPCs/Phudara/Tribe Lluvia/Elaindra Raindew.md","content":"Elaindra holds the position of main pillar of rain within the water path. Her influence on the [[Lluvia Tribe]] runs deep, as she previously served as its matriarch and left an indelible mark by renaming the tribe during her reign. She maintains her power in the nascent soul realm of cultivation."},{"path":"/Articles/NPCs/Phudara/Tribe Lluvia/Faelara Rest.md","content":"[[Faelara]] stands as a supreme elder of the [[Lluvia Tribe]], having achieved remarkable advancement to the nascent soul realm before reaching 500 years of age—a feat considered exceptionally swift among the island's cultivators. As the main pillar of wind, she wields considerable influence within the tribe.\n\nHer martial and spiritual legacy manifests in multiple ways: she is the mother of [[Quill Rest]] and took [[Public/Articles/PCs/Laura Cassini|Laura]] under her wing as a disciple, intending to teach her the Arcane Archer path—a unique cultivation method of her own creation. Her reputation was forged in part during the trial of fire, where rumors tell of her emerging as the sole survivor after slaying hundreds of competitors."},{"path":"/Articles/NPCs/Phudara/Tribe Lluvia/Nami.md","content":"[[Nami]] is a female elven initiate who serves under the matriarch [[Selene Aeloria]]. She performs her duties as one of the matriarch's many servants."},{"path":"/Articles/NPCs/Phudara/Tribe Lluvia/Quill Rest.md","content":"[[Quill Rest]] stands as the holy son and young master of the [[Lluvia Tribe]], bearing the rare distinction of being born with a divine meridian of both water and wind. As the son of [[Faelara Rest]], his significance to the tribe extends beyond his prestigious parentage—he represents hope for the tribe's gender disparity, making him an especially treasured figure. His careful upbringing and beloved status within the tribe reflect both his importance as a male descendant and the high expectations placed upon his divine potential."},{"path":"/Articles/NPCs/Phudara/Tribe Lluvia/Selene Aeloria.md","content":"[[Selene Aeloria]] serves as the current matriarch of the [[Lluvia Tribe]], commanding authority from the nascent soul realm. Her personality is notably coquettish, a trait that stands in interesting contrast to her powerful position and cultivation level."},{"path":"/Articles/PCs/Gio.md","content":""},{"path":"/Articles/PCs/Herng Azurit.md","content":""},{"path":"/Articles/PCs/Laura Cassini.md","content":""},{"path":"/Articles/PCs/Nilo.md","content":""},{"path":"/Articles/PCs/Thalassios Euphasath.md","content":""},{"path":"/Articles/Story Events/A Rogue Fire-Poison Cultivator.md","content":"## A Rogue Fire-Poison Cultivator\n\nMeanwhile, the supervising masters are urgently summoned to the Llamarada tribe. Sensing something amiss, Nilo & Gio and Laura & Thallassios follow them. Herng and Marisella, slower than Rachel, stop to help a lost girl, Nara, searching for her father. They arrive at the tribe to find massive fires engulfing the master district. Even the fire cultivators struggle to contain the flames, and the tribes cooperate to manage the disaster.\n\nThe party learns that Korrin Flameheart, a Llamarada master accused of secretly cultivating forbidden essences, resisted arrest and defeated Kaelan, the earth master, leaving him gravely injured. Herng rushes into the burning mansion to save Nara's father, though he is severely injured and crippled. Nilo steps up to treat his injuries, saving his future. After the fire is controlled, Nilo and Gio are praised by Vanya and Elira, who formally take them as disciples and assign them another core, revealing they needed two for the trial. Herng and Marisella are similarly rewarded for their bravery, with Herng assigned to Kaelan and Marisella to Morwen.\n\nLaura and Thallassios, with only one core between them, decide Thallassios should attempt the duel. He challenges Llyrith, a storm sorceress who has repeatedly failed her duels. Llyrith eagerly accepts, underestimating him. During the duel, their intense battle draws a crowd, including the supreme elders. Though Thallassios nearly ends it quickly, Llyrith counters with fog essence, turning the fight into a chaotic, blind exchange. Thallassios ultimately exploits a weakness to land a decisive blow, winning the duel and earning recognition from the matriarch. However, he struggles to find a master, as most of the tribe’s organizations are female-only.\n\nWith their trials complete, everyone but Laura becomes an external disciple. Laura, still needing another core, resolves to continue. The party, now recognized, can take on missions from the tribes' boards, provided they cooperate under the approval of a master."},{"path":"/Articles/Story Events/Aurelia, the Golden Temptress.md","content":"# Aurelia, the Golden Temptress\n\nAfter their separate escapes, the main party members found themselves reunited in a mysterious room with five paths, each leading to deadly traps. After solving an otherworldly puzzle and helping clean Gio's darkened skin, they proceeded cautiously, noting ominous warnings about greed and cursed gold along their way.\n\nTheir path led them to a chamber filled with an extraordinary amount of gold and treasure chests – enough to repair their ship multiple times over. Despite their initial wariness of the warning messages, events took an unexpected turn when Lollipop, Gio's snake companion, awoke at the scent of gold. The snake promptly awakened the room's guardian spirit and fled to safety, closing the door behind them.\n\nThe guardian revealed herself as Aurelia, the Golden Temptress, who immediately began demanding money and worship from the party in an unusual display of financial domination. While most of the party found humor in this bizarre situation, Laura remained notably irritated, refusing to either obey or offer money. The situation escalated when Aurelia summoned a mimic to attack Laura, demanding she sign a promissory note for 1,000 gold pieces as an apology.\n\nAs the confrontation unfolded, different party members took various approaches: Gio attempted to distance himself from the situation, while Nilo tried to outsmart Aurelia by signing the note with a false name (Dexter). Though initially successful, Aurelia's discovery of the deception led her to add a zero to their imaginary debt. Laura and Herng struggled to escape while the others continued to provoke Aurelia, each taunt resulting in another zero being added to the debt until it reached one million gold.\n\nThe situation changed dramatically when Lollipop returned, now disguised as a wealthy young master prince and heir to a powerful empire. The snake spirit intervened under the pretense of protecting its \"little brother\" Gio, wielding a golden bell that awakened greed in everyone present. Aurelia, completely fooled by the disguise, attempted to charm the supposed prince, only to be knocked unconscious when she turned her back.\n\nTaking advantage of this opportunity, the party quickly gathered as much treasure as they could carry – each member taking a heavy chest of gold, with Nilo filling his bag of holding to capacity. They retreated to a safe distance for a short rest, hearing Aurelia's complaints from her chamber but knowing she was bound to the room as its guardian.\n\nFinally, the group chose a random path forward, managing to overcome its traps through a combination of brute force and clever thinking, carrying their newfound wealth with them as they proceeded deeper into the trial's challenges."},{"path":"/Articles/Story Events/Escaping to the Third Stage.md","content":"## Escaping to the Third Stage\n\nAfter Mu Youqing's devastating display of power forced a retreat, each character faced defining moments that would shape their paths forward:\n\nThallassios, having been thrown far from the battle with the Frostreaver lost among the animated branches, faced a critical choice. The easy path to safety lay before him, but it would mean abandoning Selune and the blade forever. Despite Selune's own insistence that he prioritize his survival, Thallassios chose to fight his way back through the grasping vegetation. His decision was driven not by pride or duty, but by the genuine bond they had forged. Though he emerged from this ordeal looking somewhat foolish compared to the battle's stronger combatants, he maintained his connection with Selune and the Frostreaver without suffering the severe consequences that could have befallen him.\n\nHerng's moment of truth came when he witnessed Marisella in mortal danger. Having recently experienced death and resurrection himself, he initially froze, almost choosing to flee alone. Harpy's presence offered no comfort, as she showed clear reluctance to help and seemed preoccupied with other concerns. It took the distant but palpable disapproval of Lathander to finally spur Herng to action. In a moment of desperate courage, he forced Harpy to serve as a power source for his map against her will. This action revealed far more than expected – the entire continent of Phudara appeared on the map, unleashing unprecedented power that allowed him to save Marisella through the combined force of maps and stars.\n\nLaura found herself struggling alongside Lumina and Wang on her flying broom. Their escape was repeatedly complicated by Wang, who seemed to actively make their situation worse at every turn. When things appeared most dire, Lumina revealed a darker side of her abilities, producing a magical staff to control others as living shields during their escape. The situation took a bitter turn when Wang, after regaining consciousness and receiving Laura's own broom, chose to abandon them despite his grand promises of return and rescue. Moments later, a devastating cone of cold attack left Laura unconscious. In this state, she encountered Ardathian, the giant copper dragon residing within her dragonmark. The dragon offered his power in exchange for a weighty promise – Laura would have to kill Okateira, the origin dragon responsible for Ardathian's death. This pact would have far-reaching implications for her future.\n\nNilo's escape alongside Lime took a dire turn when they found themselves cornered by Mu Youqing's clone. Though weakened from the previous battle, it was still an overwhelming force that nearly crushed Nilo effortlessly. In this moment of desperation, a spirit suddenly emerged from Lime's body – her grandfather, a powerful expert whom she had been carrying within her. With the dignified demeanor of an old master, he engaged the clone in combat, using the last of his strength to hold it at bay. Before sacrificing himself to ensure their escape, he bestowed upon them a heart-crushing technique and bid a final farewell to Lime.\n\nWhen confronted with this gifted power, Nilo experienced an epiphany from beyond the void, transforming the heart-crushing technique into a heart-consuming one. Their path of survival seemed set on a dark course until Serenella Sunflare, a familiar face to Nilo, appeared attempting to organize an orderly escape. This moment offered a potential turning point, but Lime's inability to contain her bloodlust led to her attacking Serenella. Despite Nilo's attempts to de-escalate the situation and others trying to intervene, he failed to persuade Lime to stop. The situation reached its tragic climax when Lime began breaking through to the adept level, defying the heavens by consuming Serenella. This left Nilo with no choice but to continue their bloody path to survival, though the weight of these actions and sacrifices would surely haunt him.\n\nGio's escape took an unexpected turn when he found himself hindered by flying puppets that seemed strangely attracted to his presence. Seeing others in need of help but doubting his ability to save them alone, he experienced a surprising intervention. His snake, Lollipop, spoke to him, describing the righteous path as one bound by chains that could only be broken through greater strength. Following the snake's suggestion to use an enlarge spell, Gio transformed into a mythical Xuanwu turtle. This new form allowed him to save numerous lives by carrying others to safety on his back. However, unbeknownst to Gio, Lollipop's encouraging words about heroism and taking full responsibility for everyone's safety were motivated more by calculating self-interest than genuine concern for others' well-being. The snake cleverly masked its greed behind calls for the greater good, setting up a dynamic that would influence their relationship going forward."},{"path":"/Articles/Story Events/Fighting Korrin I.md","content":"The chosen ones' newfound mastery over the trial of fire's pocket dimension revealed a stark view of its labyrinth's final stage. Among the few dozen survivors of the original hundreds, they spotted [[Korrin]] and his followers approaching - bloodied, injured, but determined. Despite initial thoughts of ambush, their hesitation to engage gave way to a tense confrontation. [[Korrin]]'s passionate warnings against the island's influence fell on deaf ears, and his frustration erupted into violence with a declaration to thin the ranks of the island's supporters.\n\nWhat followed was a battle that would swing wildly between triumph and despair. [[Korrin]]'s transformation into a young red dragon through his blood-infused [[dragonmark]] sent immediate shockwaves through the group. Fear scattered some - [[Laura Bush]] vanishing through a dimension door, [[Wang Dabao]] fleeing outright, while [[Lime]] could only cower and seek [[Nilo]]'s reassurance. Others stood their ground - [[Rachel Darm]] and [[Quill Rest]] launching into the attack, [[Marisella]] focusing on protection, and Lumina attempting to create an escape route through fog.\n\nThe dragon's scales proved impenetrable, and its first breath of fire demonstrated devastating power, claiming [[Lumina]]'s life instantly. [[Korrin]]'s elite followers pressed their advantage: [[Malek]]'s acid-enhanced strikes felled [[Rachel]], [[Llyrith]] exacted her revenge on [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] with a precise neck strike, [[Zara]] rained fire from nowhere, and [[Ravion]] nearly shattered [[Nilo]]'s bones.\n\nYet death itself seemed to bow to the will of the island, as fallen allies rose again and again. Above, [[Phudara]]'s illusory dragon form dwarfed [[Korrin]]'s transformation, a reminder of greater powers at play. When [[Lumina]] miraculously forced open an escape route, some took it - [[Lumina]] herself, [[Marisella]], and [[Lime]] fleeing to safety. [[Korrin]], growing desperate, resorted to swallowing [[Sylas]] whole, hoping to circumvent the island's protection.\n\nThe tide turned through moments of brilliant coordination: [[Gio]]'s qi-shattering strike guided by tremorsense alone, [[Rachel Darm|Rachel]]'s fog-dispelling blow that forced [[Korrin]] back to elven form, and the final coordinated assault by [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] and [[Public/Articles/PCs/Herng Azurit|Herng]]. Victory found the party standing over their unconscious or dead opponents, the Liberation Sect thoroughly defeated.\n"},{"path":"/Articles/Story Events/Fighting the Guardian.md","content":"## Fighting the Guardian\n\nThe day of battle began with Nilo's desperate gambit—consuming his stored crocodile heart to break through to the quasi-adept level. The transformation filled him with an unsettling surge of aggression and bloodlust, even as the rest of their forces took their positions in carefully planned formations, with scout groups moving ahead to locate their target.\n\nThey never heard from the scouts again. Their deaths were felt as mere tremors before true devastation struck.\n\nMu Youqing appeared in the sky like a bolt of lightning, his mere presence shattering their external barrier. The cultivators maintaining it collapsed, coughing blood as they realized with horror that his attack had cursed them. Many died in that first instant, their lives extinguished before they could even comprehend what had happened.\n\nThe battle erupted with Youqing darting into their midst. Despite their numbers, most attacks barely scratched him, the difference in cultivation realms rendering their efforts futile. Only a select few posed any real threat: the spell formations, Korrin and his elite adepts, and surprisingly, Gio. Thallassios joined their ranks as he activated his Flametongue, his power amplified by Selune's energy flowing through the Frostreaver.\n\nYouqing's counterattack was devastating. Thallassios suffered grievous wounds, and others fell before his might. Yet the formations held, barely surviving each impact. Korrin and Ren, the formation specialist, began to make progress with their sealing technique. Victory seemed within reach—until everything collapsed.\n\nThe formations shattered without warning. A new figure appeared, holding an unconscious Ren: another Mu Youqing, but this one radiated a dignified presence that made the first seem like a pale imitation. Gone was the guardian's hint of madness, replaced by cold arrogance as he questioned their audacity in challenging him. His words cut deeper than any blade—they had barely defeated his clone with hundreds of cultivators, and even then, only a handful could inflict any damage.\n\nWith a single finger, he disarmed Thallassios, sending both him and the Frostreaver flying hundreds of feet through the air. A massive shadow spread from the main body, commanding all vegetation in its reach. Plants writhed to life, seizing anyone within their grasp.\n\nKorrin's command cut through the chaos: \"Run! The operation has failed. If even one of you reaches the third stage and claims the inheritance, we might save everyone by concluding this trial!\" As cultivators fled for their lives, Korrin underwent a shocking transformation. His body expanded into that of a massive dragon, preparing to face Mu Youqing alone.\n\nNilo and Laura felt the transformation in their very beings, their dragonmarks resonating with Korrin's dragon form. They could only look back in awe as they ran, witnessing a clash of powers beyond their comprehension."},{"path":"/Articles/Story Events/First Half of the Inheritance.md","content":"The party reached a fork in their path. Consulting his magical map, [[Herng Azurit|Herng]] received guidance to proceed straight ahead. Burdened by their substantial treasure of gold-filled chests, the group decided to conceal their loot in a corner, protecting it with a simple alarm spell before moving forward.\n\nWhile his companions advanced, [[Gio]] lingered behind to investigate the alternate path. There, he discovered a chamber containing an imposing feminine mask with dim crimson crystal eyes. Though unsettled, he chose not to investigate further and rejoined the group, sharing his discovery with [[Public/Articles/PCs/Laura Cassini|Laura]].\n \nAhead, the party encountered what appeared to be humanoid figures restrained on the floor. [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] recognized this as an illusion trap, but before he could fully warn his companions, a Giant Scorpion struck with devastating speed, incapacitating him in a single blow. The group rallied quickly, defeating the creature and using [[Public/Articles/PCs/Laura Cassini|Laura]]'s divine rain ability to restore their health during a brief ten-minute rest.\n\n"},{"path":"/Articles/Story Events/Grommash’s Incident.md","content":"While walking through the tribe the next morning, [[Grommash Thunderfist|Grommash]] notices a beautiful mature woman and impulsively asks a nearby \"girl\" about her identity. To his shock, the \"girl\" turns out to be **[[Quill Rest]]**, the holy son of the tribe, and one of the rare male cultivators. [[Quill Rest|Quill]] is highly respected and popular within the cultivation world.\n\nOffended by [[Grommash Thunderfist|Grommash]]’s remarks, [[Quill Rest|Quill]] uses his cultivation to suppress him and declares [[Grommash Thunderfist|Grommash]] banished not only from Tribe Lluvia but also from all three great tribes. Feeling humiliated, [[Grommash Thunderfist|Grommash]] flees to the mountains. [[Public/Articles/PCs/Laura Cassini|Laura]] and [[Public/Articles/PCs/Herng Azurit|Herng]], unbothered by his absence, do not pursue him.\n"},{"path":"/Articles/Story Events/Harpy's Grievances.md","content":"After a long period of unconsciousness, having been used as an unwilling power source for Herng's starmap, [[Harpy]] broke down before his companions, pouring out her grievances through tears and emotion. Though the group was preoccupied with the true inheritance, they couldn't help but exchange uncomfortable glances as the distressed fey creature shared her tale, their expressions a mix of sympathy and unease."},{"path":"/Articles/Story Events/Harpy's Sincerity.md","content":"## Harpy's Sincerity\n\nAfter their deaths during the trial, Herng and Marisella found themselves in a cosmic space, kneeling before an irritated Harpy. She berated them for dying at such an inconvenient moment, explaining that while she could easily resurrect them, doing so in front of witnesses would compromise her larger plans. As she continued her lecture, she proposed sending them to a special domain for a hundred years of training, dismissing their concerns about the time span by explaining the fluid nature of time in her realm.\n\nThis scene was interrupted by the dramatic appearance of Lathander himself, whom Marisella immediately addressed as \"Father.\" The god's presence nearly overwhelmed Herng, whose mortal consciousness struggled to process the divine manifestation. Only Harpy's intervention kept him from completely breaking down, while Marisella appeared notably accustomed to her divine father's presence.\n\nWhat began as Lathander making demands regarding his daughter quickly devolved into an unexpected squabble. Harpy accused him of false concern for Marisella, suggesting his true motivation was control over Amaterra. When Lathander attempted to intimidate her with his divine power, Harpy remained unimpressed, dismissively noting that this was merely his avatar rather than his true form. She then revealed her own true appearance: a majestic adult fey being with draconic features.\n\nThe encounter reached its climax as Harpy not only dominated Lathander's avatar but proceeded to negotiate an extortion of cosmic resources from him. The sheer scale of these \"galaxy grade\" resources proved too much for Herng's mortal mind to comprehend, and he lost consciousness during their exchange of power, unable to process the true scope of what he was witnessing."},{"path":"/Articles/Story Events/Hierarchy of Power.md","content":"### Hierarchy of Power\n\nAll three tribes follow a similar hierarchy of power, based on cultivation realms:\n\n1. **Tribe Head**: The eldest and most powerful supreme elder, who serves as the tribe’s leader.\n2. **Supreme Elders**: Grandmaster-level cultivators in the \"Nascent Soul Realm.\" Each tribe has two, except for the head.\n3. **Masters**: Cultivators in the \"Core Formation Realm\" who serve as the foundation of the tribe's future. Each tribe has 6 to 12.\n4. **Internal Disciples**: Adept-level cultivators in the \"Foundation Establishment Realm.\" Numbering in the hundreds, they are the first line of defense.\n5. **External Disciples**: Initiate-level cultivators in the \"Qi Refining Realm.\" They make up the vast majority of cultivators, numbering in the thousands.\n6. **Mortals**: Non-cultivators, forming the majority of the population, numbering in the tens of thousands.\n\nThe strength and status of individuals increase exponentially with each cultivation realm."},{"path":"/Articles/Story Events/Introduction to Espora.md","content":"[[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] and [[Gio]] visit [[Tribe Espora]], where they are greeted by **[[Laura Bush]]**, the holy daughter of the tribe and granddaughter of its sovereign leader. The tribe specializes in **poison**, **wood**, and **acid essences**, but its members suffer from severe drug addiction, likely caused by the practitioners of the poison path.\n\nThe tribe's leadership comprises:\n\n- **[[Zarvon Fungart]]**: Sovereign Leader and Pillar of Wood.\n- **[[Ryndar Moldshade]]**: Supreme Elder and Pillar of Poison.\n- **[[Orin Acidbranch]]**: Supreme Elder and Pillar of Acid.\n    - Both Ryndar and Orin appear to be under Zarvon’s control through spore cultivation."},{"path":"/Articles/Story Events/Introduction to Llamarada.md","content":"[[Nilo]] and [[Marisella]], along with the goat, visit [[Tribe Llamarada]]. They are introduced to the tribe by siblings **[[Rena]]** and **[[Oxitee]]**. The tribe struggles with limited resources, especially during periods of volcanic inactivity. However, with the volcano showing signs of life again, the tribe has become increasingly busy.\n\nTribe Llamarada specializes in **martial arts** and to a lesser extent, **fire sorcery**, mastering **fire**, **metal**, and **earth essences**. Competition for resources is fierce, with thievery and conflict being commonplace.\n\nThe tribe's leadership comprises:\n\n- **[[Thornor Bramblehelm]]**: Patriarch and Pillar of Metal.\n- **[[Morwen Darm]]**: Supreme Elder and Pillar of Fire.\n- **[[Talon Scorch]]**: Supreme Elder and Pillar of Fire.\n- The tribe currently lacks a Pillar of Earth."},{"path":"/Articles/Story Events/Introduction to Lluvia.md","content":"[[Public/Articles/PCs/Laura Cassini|Laura]], [[Public/Articles/PCs/Herng Azurit|Herng]], and [[Grommash Thunderfist|Grommash]] visit the [[Tribe Lluvia]], guided by **[[Nami]]**, a servant of the tribe's matriarch **[[Selene Aeloria]]**. [[Tribe Lluvia]] focuses on mastering **water** and **wind essences** and has a strong affinity for sorceresses. Due to this magical inclination, they follow a **matriarchal system**, with women holding most of the power. Men in the tribe primarily handle farming and fishing, the latter being a dangerous yet respected profession due to the mysteries and powerful creatures of the surrounding sea.\n\nThe tribe's leadership comprises:\n\n- **[[Selene Aeloria]]**: Matriarch and leader.\n- **[[Faelara Rest]]**: Supreme Elder and Pillar of Wind.\n- **[[Elaindra Raindew]]**: Supreme Elder and Pillar of Water."},{"path":"/Articles/Story Events/Joining the Tribes.md","content":"### Joining the Tribes\n\nThe party regroups and shares their bizarre experiences. Without a clear plan besides repairing their ship and leaving the island, they decide to visit the supreme elders of each tribe to learn more about the situation. They discover that the Lluvia tribe, previously known as the Storm tribe, lost the \"right\" to cultivate the lightning essence after a catastrophic event. The tribe has since transitioned to focusing on the other two essences and lost its earlier gender equality. In the Llamarada tribe, Thornor personally approaches Gio, inviting him to join the tribe as his disciple to sharpen his martial arts and overcome his cultivation bottleneck. Gio declines, preferring his drug habit, but agrees to practice with him in private. Meanwhile, in the Espora tribe, the party notices Zarvon's mental instability and moments of clarity, realizing that the other supreme elders are likely under his control, shaping the tribe's strange dynamics.\n\nEventually, the party members choose their paths. Laura joins the Lluvia tribe, intrigued by wind as a way to master her navigation skills. Thallassios is similarly drawn to wind, finding it fascinating as a foreign concept for a triton. Rudy joins to fish and earn money. Gio and Nilo decide on the Espora tribe, curious about its poison cultivation and mysterious atmosphere. Herng and Marisella join the Llamarada tribe, with Herng motivated to study rocks in the volcano and Marisella unwilling to leave him alone.\n\nEach tribe provides their new initiates with basic cultivation scriptures. To become external disciples, they must complete a trial: retrieve an elemental core from their tribe's dungeon and win a duel against another candidate with a core. The dungeons are Venomshade Sanctum for the Espora tribe, Aquagloom Abyss for the Lluvia tribe, and Inferno Heart Citadel for the Llamarada tribe. Each initiate is assigned a master to supervise their trials.\n\nIn the Espora tribe, Nilo and Gio struggle after ambushing a wood elemental and are chased away by minor elementals known as \"wood goblins,\" fleeing like startled rabbits. They are supervised by Vanya and Elira, who also serve as external relations ambassadors. Laura and Thallassios face water goblins but struggle against the water elemental, failing their trial. They are saved by Ces, the only male master in the Lluvia tribe and an external relations ambassador. Herng and Marisella, unsupervised when Morwen leaves abruptly, easily defeat fire goblins and elementals, securing two fire cores. On their way back, they are met by Rachel Darm, the Llamarada tribe's holy daughter and Morwen's daughter. Midway through their return, Rachel learns of a crisis in her tribe and rushes ahead, furious that her mother called her away to keep her safe."},{"path":"/Articles/Story Events/Korrin's Sincerity.md","content":"## Korrin's Sincerity\n\nWhen Korrin finally made contact with the party, his approach was one of careful diplomacy. He expressed genuine remorse for their previous conflicts, attributing them to unfortunate misunderstandings. To demonstrate his sincerity, he presented each member with a powerful magical item, carefully selected to match their abilities. Other sect members followed suit, showering the group with attention.\n\nAmong these gifts, Laura's stood out for its personal touch—a ring of spell storing with her name delicately engraved upon its surface. Her inspection revealed two spells bound to it: an unknown 6th-level enchantment worked into the ring itself, and a 5th-level spell stored within. Though she attuned to the ring, she approached it with caution, choosing not to trigger the stored spell.\n\nThat night, the ring's true purpose revealed itself. The Contingency spell activated, launching Laura into a magical dream where she found herself standing before her old house in her hometown. There, Korrin waited, seated at a piano—a detail that immediately raised Laura's suspicions.\n\nHis attempt to address her as a member of House Aesio met with unexpected resistance; Laura's apparent ignorance about her own dragonmark caught him off guard, though he maintained his composure. Taking this revelation in stride, he shifted to a more fundamental explanation about the true nature of dragonmarks and the current political landscape.\n\nThe truth he unveiled was intricate and disturbing. The noble houses, he explained, were locked in subtle warfare, their very existence threatened by a crucial detail: houses whose origin dragons had perished faced potential extinction. Both House Aesio and his own House Veridis stood in this precarious position. His proposal was direct—cooperation offered their only path to survival, as trust had become a rare commodity in their world.\n\nBut this political revelation was merely the surface of deeper, more fundamental truths about their world. The planet itself, Korrin explained, defied normal celestial mechanics. Rather than orbiting a fixed star, it wandered between universes, its path occasionally influenced but never fully captured by the suns it passed. The very geography of their world proved equally mutable, shaped and reshaped by the rising and falling of dragon rules.\n\nThe recent appearance of a new moon hung over these revelations like an ominous shadow—a bad omen, according to those who studied such things. Korrin spoke of a gathering storm, yet maintained that his mission held the potential to alter their fate's trajectory.\n\nThe dream ended leaving Laura adrift in a sea of uncertainties. The foundations of her understanding had been shaken, replaced with troubling questions about whom to trust and what path to follow. Korrin's revelations had not so much illuminated her way forward as revealed the complexity of the choices that lay before her."},{"path":"/Articles/Story Events/Meeting the Will of the Island.md","content":"After her outburst, [[Harpy]] focused on unlocking the mask, revealing it to be a gateway to another chamber. As the party entered, they found themselves engulfed in an ethereal atmosphere - a green fog with dark undertones permeating the space. At its center stood a podium emanating an otherworldly essence, which each member perceived uniquely. Despite its beckoning presence, only [[Public/Articles/PCs/Herng Azurit|Herng]] and [[Nilo]] approached, while the others held back with visible hesitation. A feminine yet abstract entity, manifesting as the will of the island, sighed at their apparent lack of unity.\n\nThe green mist thickened around them, and they suddenly realized only the core five remained. The entity introduced herself, inquiring about their purpose. She expressed her belief that their connection to her close associates must have meant they were potential allies. However, the party's confusion quickly dispelled this notion. She revealed that [[Gio]], [[Public/Articles/PCs/Herng Azurit|Herng]], and [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] had been brought by her followers, while [[Public/Articles/PCs/Laura Cassini|Laura]] and [[Nilo]]'s presence, though seemingly unconnected, intrigued her due to their [[Dragonmark|dragonmarks]].\n\nThe entity contemplated whether they might be chosen by the ghosts, disciples of her followers, dragon disciples, or bound by some unknown fate, but found herself perplexed by the absence of such connections. She identified herself as the leader of the [[The Shadow Sect|Shadow Sect]], explaining that trial winners become external disciples, while those with her continued approval could ascend to inner disciples. [[Harpy]], she noted, served as a self-proclaimed saintess, scouting talent across the island.\n\nWhen questioned about the sect's mission, she unveiled an ambitious plan to open pathways to the Feywild and Shadowfell, aiming to establish the cycle of rebirth in [[Amaterra]]. She expressed regret at the misunderstanding, explaining she wouldn't have permitted their presence had she known they weren't aligned with her cause, as she valued loyalty above all else.\n\nFinally, she revealed herself as [[Phudara]], recounting her ancient conflict with [[Retharax]] the origin red dragon and [[Vyrelaxan]] the origin green dragon. She spoke of killing one and sealing the other in the volcano, while nurturing the island's inhabitants and preparing for [[Retharax]]'s inevitable return. She exposed [[Korrin Flameheart]] as a spy from house Veridis, connected to both dragons.\n\nEncouraging the party to focus on immediate concerns rather than larger schemes, she asked them to name worthy winners for the trial of fire. [[Nilo]] and [[Gio]] supported [[Lime]], [[Public/Articles/PCs/Laura Cassini|Laura]] and [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] backed [[Lumina]], while [[Public/Articles/PCs/Herng Azurit|Herng]] chose [[Rachel Darm]]. Recognizing her growing needs, [[Phudara]] decided to cast a wider net this cycle, recruiting multiple promising candidates: [[Lumina]], [[Lime]], [[Quill Rest]], and [[Sylas]]. Though clearly doubtful of their potential, she hoped that at least one of them might prove useful to her cause. She ultimately granted the wood inheritance to [[Lime]] for her wooden cultivation abilities."},{"path":"/Articles/Story Events/Nilo’s Nightmare and Marisella’s Dream.md","content":"During their stay, [[Nilo]] wakes up from a nightmare in which **[[Umberleeh|Emberlee]]** curses him after drawing him in with her siren song. Disturbed, he confides in **[[Marisella]]**, who stays up late as usual to pray. She tries to comfort him and apologizes for her earlier provocative behavior. In a candid moment, she expresses her belief that she should adopt [[Nilo]], given his youth. She further reveals her dream of repopulating the world with countless children who would worship her faith, leaving [[Nilo]] bewildered.\n"},{"path":"/Articles/Story Events/Passing the News to the Three Great Tribes.md","content":"## Passing the News to the Three Great Tribes\n\nUpon their return to the Lluvia Tribe, the party's initial celebration as heroes was quickly overshadowed by the electric atmosphere of the battle arena. There, Quill Rest, son of Faelara and the tribe's prodigy, had been challenging sparring partners in preparation for his advancement to the adept stage. Having already claimed thirty-three consecutive victories over several days, Quill had become a sensation among the tribe members.\n\nThallassios, displaying his characteristic but often misplaced bravado, stepped forward to challenge Quill despite the obvious power disparity. The match proved brutally one-sided, with Thallassios suffering a devastating knockout from a single strike. Herng, taking pity on his companion, secretly aided him with healing magic between rounds, allowing Thallassios to rise for several more attempts—each ending in swift defeat. Irritated by this interference, Quill turned his challenge toward Herng, who refused to engage, earning the crowd's disapproval. While the others showed no interest in participating, Gio unexpectedly entered the fray. The ensuing match took an unusual turn when Gio employed a magical dart to confuse his opponent, but then declared the combat too tedious and left the arena—a decision that left spectators bewildered.\n\nThe excitement reached its peak with the arrival of Faelara Rest, who descended upon the arena from above. She announced a momentous opportunity: the Trial of Fire, a competition that would allow initiates to breakthrough to the adept level. The trial would select the hundred most talented initiates across their generation, requiring them to form groups of three.\n\nFaelara had already taken special notice of Laura during their heroic return, offering her a prestigious position as her second disciple after her son Quill—a rare honor within the tribe. This new relationship led to Faelara exercising her authority by ordering Laura to join Quill's team for the competition. Despite Laura's preference to compete alongside her companions, she had no choice but to accept, as the arrangement would provide the protection of an adept-level dharma protector. Meanwhile, Thallassios found himself struggling to secure a team, his participation in the trial hanging precariously in the balance.\n\nThe party shared their discoveries about the Liberation Sect's activities with the three tribes, though they strategically withheld the revelation about Korrin's origins as an outsider, fearing potential compromises within the tribal leadership. However, their efforts to pursue justice met with unexpected resistance. The leaders of all three tribes uniformly advised the party to distance themselves from the matter, establishing clear boundaries around their involvement in this sensitive political situation.\n\nThis response left the group in a complex position, caught between their newfound status as tribal heroes, their individual paths forward in the competition, and the growing web of secrets they now carried."},{"path":"/Articles/Story Events/Preparing for the Trial of Fire.md","content":"# Preparing for the Trial of Fire\n\nAs the Trial of Fire approached, the party members spent time with their respective tribes, each pursuing different paths of preparation.\n\n## Individual Training\n\n**Herng's Initiation** At Kaelan's dojo, Herng discovered he and Rachel were the only initiates among a group of adept-level disciples. His \"welcome\" consisted of several days of intense sparring sessions—or rather, systematic beatings—as the adepts took turns \"training\" their new companion, marking his initiation into their order.\n\n**Laura's Advancement** Under Faelara's guidance, Laura devoted herself to mastering the arcane archer path—a unique cultivation method invented by her master through extraordinary talent. She trained alongside the adepts of her order, learning to merge archery with magical techniques.\n\n**Gio's Martial Growth** Gio's training led him to Thornor, the Llamarada tribe's patriarch. Their sparring sessions expanded Gio's understanding of martial arts, with Thornor demonstrating seemingly limitless weapon mastery. Impressed by Gio's foreign fighting techniques, Thornor rewarded him with a substantial amount of platinum.\n\n**Thallassios's Dangerous Path** Struggling to form a team for the trial, Thallassios fell into a trap set by Seris, one of Lady Elowen's adoptive daughters. Under the guise of training, she initiated him into dual cultivation—a taboo practice given the tribe's gender imbalance and males' low compatibility with rain essences. As rumors spread about their nightly encounters, Thallassios's progress suffered rather than improved.\n\n**Nilo's Path to Yang Cultivation** During this period, Elira shared with Nilo five recipes for yin path method cantrips, each corresponding to the five yin organs and elements—a technique in which she excelled. However, these methods proved unsuitable for Nilo due to his male nature. When consulting with Vanya about this challenge, she suggested that cultivating yin energy typically required embracing feminine aspects. Taking inspiration from his master's early cultivation journey, Nilo is to work in solitude to develop his own equivalent methods, adapting the techniques to work with yang organs and energy more suited to his natural disposition.\n\n**Nilo and Gio's Companion** Their masters, Vanya and Elira, bestowed powerful artifacts upon them. Vanya gave Gio a magical lollipop infused with serpent qi, sharing her own experiences with it during past trials while warning them about the Serpentsoul clan's aggressive marriage proposals. Elira presented Nilo with a rare reincarnation amulet, expressing her concern for his safety.\n\n**Team Formation**\n\nTheir masters recommended several potential teammates:\n\n- Vaelith: Arcane trickster of the poison path\n- Verdis: Wood path ranger\n- Ronan: Poison path ranger\n- Thalion Swiftblade: Wood and sword path ranger\n- Thunder: Wood path ranger and druid beastmaster\n- Lime: Wood path druid\n- Laura Bush: Though not recommended, possessed powerful artifacts\n\nNilo and Gio ultimately chose Lime, a druid with healing capabilities and charming look. With Vanya's help, they impressed her by demonstrating Gio's ability to consume poison cores effortlessly. Though Lime feigned amazement (unbeknownst to them), she agreed to join their team.\n\n## Final Preparations\n\nThe party regrouped with Marisella and Lime for one final expedition into the Aquagloom Abyss, having acquired the necessary magical items and materials for extended underwater exploration. This venture would serve as their last preparation before the upcoming trial.\n"},{"path":"/Articles/Story Events/Reuniting at the Liberation Sect Mansion.md","content":"## Reuniting at the Liberation Sect Mansion\n\nThe reunion at Korrin's interdimensional mansion brought with it a mix of grief and desperate hope. Team Aqua learned of Herng and Marisella's fate, the news landing heavily among them. Wang Dabao, despite the somber atmosphere, couldn't contain his excitement at meeting Marisella, though the timing of his enthusiasm felt oddly displaced against the gravity of their situation.\n\nWith the resurrection attempt scheduled for the following day, preparations took on an urgent rhythm. Nilo and Gio had already made extensive arrangements, with Nilo drawing inspiration from his master's research into yin organs. His theory was ambitious yet grounded in a macabre logic—if he could craft replacement organs for Herng and Marisella's crushed internals, the very curse that claimed their lives might preserve them in a state between life and death long enough for the procedure to work.\n\nAs night fell over the mansion, a subtle drama began to unfold in its corridors. Lumina paced outside the rooms, her usual confidence replaced by visible anxiety as she struggled to find the courage to approach Nilo. Laura, noticing this unusual behavior, fabricated a reason to visit the kitchen, keeping a careful eye on Lumina's movements while maintaining a facade of casual indifference.\n\nThe situation grew more complex when Lime emerged from her room. She took note of Lumina's nervous energy but proceeded past her with practiced nonchalance, entering Nilo's room as if it were a familiar routine. Lumina, unable to resist, positioned herself near the door, straining to hear their interaction. Inside, Lime's behavior shifted to something more provocative, her words of encouragement carrying a deliberate edge as she positioned herself near the door, seemingly aware of their audience.\n\nSatisfied with her performance, Lime sealed the room against eavesdroppers. Her demeanor transformed entirely as she began to dissect the political implications of tomorrow's attempted resurrection. She spoke with the sharp insight of a seasoned politician, outlining strategies to leverage their position against both the Tribes and the Sect. Her concerns extended beyond politics to Nilo's growing bloodlust, and she produced a peace offering of sorts—meat from animals she had hunted during their journey. Nilo, pragmatic despite everything, accepted some portions as a precaution.\n\nMeanwhile, Laura returned from her supposed kitchen errand to find Lumina still lingering, though the young woman quickly attempted to act as if nothing had transpired, retreating to their shared room.\n"},{"path":"/Articles/Story Events/Second Half of the Inheritance.md","content":"Upon entering the room with the huge mask, [[Quill Rest|Quill]] asks the party if they have a key. According to his understanding, this knowledge had been removed from his mother's memories. [[Nilo]] suggested using [[Harpy]], as she had been mysteriously following them since their arrival on the island, proving useful with her enigmatic abilities. She lay unconscious in [[Public/Articles/PCs/Herng Azurit|Herng]]'s bag, resembling a crumpled piece of paper."},{"path":"/Articles/Story Events/Team Aqua's Camp.md","content":"## Team Aqua's Camp\n\nAway from the others, Laura and Thallassios found a quiet moment to share their recent experiences. Thallassios spoke of Selune, who he claimed now resided within his blade, though his explanations carried a note of uncertainty that left Laura wondering about his mental state. She, in turn, offered brief glimpses of her time after the vortex incident in the Aquagloom Abyss, though she kept most details to herself.\n\nThe addition of Wang Dabao to their group brought an unexpected dynamic. The rotund bard initially presented himself as a spoiled, demanding presence, yet he gradually began to win favor with some of the party members through his candid discussions about the segregated nature of the Lluvia tribe and his personal grievances with Lady Elowen's group. His complaints, however, struck a nerve with Lumina, who belonged to that very circle. Her verbal attacks on Wang revealed the deep divisions that ran through their tribe's society.\n\nThe group watched with mixed feelings as Wang isolated himself from them, his reliability still in question. In a peculiar display, he consumed candy from his magical coat before requesting a dagger, claiming he needed it to craft a replacement for his lost wooden flute. Laura provided one, only to witness him using his own sharpened teeth to carve the wood instead. The result of his unusual crafting method was surprisingly melodious—his skillful playing brought a temporary peace to their troubled minds, though the moment was interrupted by the loud growling of his stomach. Wang's relationship with food proved as complex as his personality. Despite his constant complaints about their provisions, he would inevitably consume everything offered to him, exhibiting both pickiness and gluttony in equal measure.\n\nConcerned about Thallassios's prospects within the tribe, Wang Dabao approached him with an unusual gift—a carefully crafted wooden nose attached to what appeared to be Groucho glasses. He explained, with complete seriousness, that the artificial facial hair would make Thallassios appear more manly and improve his standing with the tribe's women. Lumina, witnessing this exchange, burst into unexpected laughter at the sight. Despite—or perhaps because of—their comical appearance, Thallassios decided to wear the glasses.\n\nOne notable evening, after their brush with ambush, he claimed to have caught a rare magical fish native to the Aquagloom Abyss. His lack of culinary skill led to an amusing collaboration with Thallassios, though their combined efforts still resulted in a less than perfect preparation. Laura steadfastly refused to partake in the fish, a decision that prompted Wang to express his concerns quietly to Thallassios about its wasted cultivation benefits. The following morning, Lumina took charge of properly preparing the remaining fish, though Laura maintained her abstinence from the meal. Lumina and Wang shared a private conversation beyond the others' hearing as they were still asleep.\n"},{"path":"/Articles/Story Events/Team Aqua's Journey.md","content":"## Team Aqua's Journey\n\nIn the midst of the bizarre forest's trembling, Lumina found herself adrift in confusion. Mere moments ago, she had been preparing to make a favorable impression on Lady Elowen alongside her elder sisters. Now, she stood beside unexpected companions, her carefully laid plans scattered like leaves in a storm. As a student of astrology, she had mapped countless possible futures for this trial, yet none had prepared her for this reality. The alien sky above spoke only of tragedy to her trained eyes.\n\nTogether with Laura and Thallassios, Lumina began their journey toward the trial's third phase. Their first test came in the form of a fearsome manticore, which they dispatched with surprising ease. As they pressed onward, they encountered an ethereal sight: a permanent aurora hanging in the sky, composed of the merged souls of an ill-fated elven scouting party. Their final report, etched in the ethereal lights, warned of their leader's transformation and pleaded with future explorers to end his \"eternal loneliness.\"\n\nTheir path led them to an peculiar encounter with a merchant who called herself Shui Ling. Despite being of the initial master stage, she seemed stranded in the middle of nowhere, offering trades with an unsettling demeanor. It was here they discovered an unconscious man from the Lluvia tribe. While Laura acquired a flying broom from the merchant, Thallassios made what many would consider a fool's bargain—trading his nose for a seemingly worthless common horn. Lumina, however, saw an opportunity in the stranger's presence. She traded one of her precious magical books to save the unconscious man's life, and made another, secret exchange with the merchant who seemed capable of communicating only through pre-prepared responses.\n\nThe saved man introduced himself as Wang Dabao, a fatty bard from the fishing guild whose jovial demeanor barely concealed deeper mysteries. As they continued their journey, they discovered the remnants of an ancient civilization. Though most structures had crumbled to dust, they recovered two significant finds: a quiver of cursed arrows and a pair of magical darkness-piercing goggles, both carrying their own sinister enchantments.\n\nTheir relative peace was shattered when members of the Espora tribe ambushed them, using the corpses of Lluvia tribe members as bait. To Lumina's horror, she recognized the dead as her elder sisters—the very ones she was meant to take the trial with. In a cold fury, she ensured their attackers met a similar fate, collecting their heads as grim trophies to present to her master.\n\nThe group pressed on, facing and defeating a Shambling Mound that bore traces of having once been a cultivator. From its remains, they claimed a lightning-infused armor. Yet their greatest challenge awaited near the mountain's approach: a massive wolf puppet that toyed with them like a cat with mice, nearly ending their journey permanently.\n\nSalvation came from an unexpected quarter—a group from the Liberation Sect. Among them was Grimmy, who offered a surprising apology to Thallassios, having gained a new understanding of the trials faced by men in the Lluvia tribe. Lumina maintained a tense silence as she faced her former captors, powerless to act in the moment. Wang Dabao's familiar greetings to several sect members, despite their different tribal origins, added another layer of mystery to his character. In the background, Llyrith's presence went unacknowledged by Thallassios, who seemed to look right through their former opponent."},{"path":"/Articles/Story Events/Team Magma's Camp.md","content":"## Team Magma's Camp\n\nWhile traveling they had moments of rest where they shared significant fond moments, like when Herng attempted to talk with women and spilled all his spagethi with Marisella for being such a beta male with no drive. Herng also tried to train with Rachel but was completely outclassed and scolded for being so weak besides being in her same Order. Harpy started avoiding herng, and seek out Gio sighing as she said that Herng was a mistake and that the magical tart was wasted on him. She then tells Gio they should bake him into a cake and start again... Gio also had a weird epiphany where he learned a mystical bite ability out of his delusions. Nilo in the other hand got to know Lime a little bit more as she struggles with the strong Yin energy of this site, making it difficult for her to control her wildshape and struggling to make potions. After the incident with the Shadowflame clan members Nilo went to check her up trying to confort her as they are kindred spirits, she smiles telling him to not to worry much, but she can't reveal her secrets yet."},{"path":"/Articles/Story Events/Team Magma's Journey.md","content":"Following the chaos of the first phase, one group consisting of Nilo, Gio, Lime, Velira, Herng, Marisella, and Rachel found themselves in an eternally dark forest devoid of wildlife and natural sounds. While the Trial of Fire was meant to restrict all participants to the initiate level of cultivation, they discovered their magical items functioning at full power—a concerning anomaly. This discovery was followed by an even more troubling sight: a cultivator at the nascent soul realm flying overhead, confirming that the trial's power restrictions had somehow failed. During this time, Marisella worked to comfort the distraught Velira, who was struggling with recent defeats.\nTheir journey through this realm revealed increasingly disturbing scenes:\n\n- A spectral library with ghostly hands searching through floating books, warning of a \"hungry forest\"\n- A training ground where spectral warriors performed increasingly desperate combat forms\n- Will-o'-wisps lamenting betrayal by someone named \"Faelara\"\n- An abandoned camp where Herng obtained a cursed item\n\nTheir progress slowed due to their need for longer rest periods compared to elves, leaving them vulnerable. This vulnerability was tested when Nerion's group, including his adept protectors Jorath and Draven Shadowflame, ambushed them. The confrontation took an unexpected turn when Lime transformed into a bear and brutally defeated Jorath, secretly consuming his foundation. Nerion pursued the fleeing Velira while Draven retreated after facing the combined party. Afterward, Nilo discreetly consumed Jorath's heart, while Marisella noted the unusual nature of Lime's male bear form.\n\nThe group's journey continued with a battle against a Chasme, collecting samples for study. However, their expedition took a tragic turn at a mysteriously abandoned camp near the mountain. Disturbing this site drew the attention of the powerful being they had observed earlier, resulting in the deaths of Herng and Marisella.\n\nSalvation came unexpectedly from Korrin, who appeared with his closest adepts and transported the survivors to a dimensional mansion. There, they found members of all three tribes and the Liberation Sect coexisting under his protection. Nilo and Gio, moved by their deep personal connections to the deceased—Nilo's gratitude for Marisella's past kindness and Gio's history with Herng—committed to attempting a resurrection. They discovered their companions' souls remained trapped in their bodies, which suffered from a Chasme-like vitality drain. Despite Lime's questioning of their resolve, Nilo even considered using his master's life-saving amulet on Marisella as they worked to gather the necessary materials for the resurrection attempt."},{"path":"/Articles/Story Events/Thallassios and Gio’s Experience.md","content":"[[Laura Bush]] offers the visitors drugs, which [[Gio]] accepts, leaving him unconscious and hallucinating. [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] refuses but accompanies [[Laura Bush|Laura]] to a secret location. She leads him to a **yellow acid pool**, where she \"accidentally\" pushes him in, nearly killing him. [[Laura Bush|Laura]] persuades him it was a mistake, and [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] returns to sleep beside Gio.\n\nThe next day, [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] awakens with his skin covered in a yellowish crust that restricts his movement, while [[Gio]] is weakened from the lingering effects of the **Wish** spell. They are rescued by **[[Vanya]]** and **[[Elira]]**, young siblings and masters of the tribe, who reveal a grave secret: **[[Zarvon Fungart]]** has cultivated spores that infiltrate the brain and allow him to manipulate others. [[Vanya]] and [[Elira]] are among the few unaffected and believe the other tribes may also be at risk. They enlist [[Public/Articles/PCs/Thalassios Euphasath|Thalassios]] and [[Gio]]'s help in finding a cure for [[Zarvon Fungart|Zarvon]]’s disease."},{"path":"/Articles/Story Events/The Aftermath and Pure Ice Inheritance.md","content":"### The Aftermath and Pure Ice Inheritance\n\nAfter capturing Dexter and witnessing Herng's revival, the party began a thorough investigation of the Liberation Sect's base. While Gio and Nilo focused on rescuing the surviving Lluvia tribe members, Thallassios, Herng, and Laura searched the premises for clues about the sect's experiments. Their search revealed detailed logs documenting various potion experiments, though it became clear the group lacked proper expertise in poison-making. The records also mentioned a figure named Harvis, an echelon seed of their group, who had disappeared into a gas crater, leaving only tattered clothes behind.\n\nAmong the captives, they discovered an adept-level jade beauty named Elowen Thorn and a peculiar initiate called Lumina, who had been treated differently from the other prisoners. Unlike the rest, she had been spared from the experiments, though she remained powerless to help her fellow captives. Together with the rescued victims, the party used their medical knowledge and the cave's natural resources to create cures for the various afflictions inflicted upon the prisoners.\n\nDuring their investigation, Laura discovered a collection of documents from the outside world, apparently stolen from Korrin. Among them, she found a seemingly blank note that reacted to her dragonmark, revealing hidden text. The message detailed correspondence between House Aesio and House Veridis regarding an expedition to \"The Land of the End,\" bearing her father's distinctive handwriting. Interrogation of Dexter revealed their connection to Korrin, whom they discovered was an outsider to the island—a fact that had terrified the sect members.\n\nThe situation grew dire when they discovered the cave's entrance had been left open, threatening to flood the complex. After securing the door, Harpy led them to a hidden sanctuary: the Pure Ice Inheritance, a domain of crystal-clear ice. Dexter expressed disbelief at their fortune, as the inheritance had remained hidden during his years of exploration.\n\nWithin this sacred space, the party underwent trials testing their convictions about purity. Their success earned them powerful rewards: three tears of Crystalina, a magical wand, a magical scimitar, and a single-use Ice Storm object. The party distributed these treasures, with Herng claiming the wand and Thallassios receiving the Frostreaver from Laura.\n\nTheir victory was short-lived, however, as Dexter managed an audacious escape. Using frog excrement as a component for an invisibility spell, he successfully broke free from captivity and sealed the door with an arcane lock, leaving the party to contemplate their next move."},{"path":"/Articles/Story Events/The Chupacabra Incident.md","content":"## The Chupacabra Incident\n\nA peculiar side quest emerged when the tribes reported a demonic beast terrorizing the area, believed to be the mythical \"Chupacabra.\" The party, concerned about their missing carnivorous goat, began their investigation in the forests of the Espora Tribe. Their search led them to an unusual sight: a colony of ants forming mysterious patterns around magical excrement. As they examined the scene, they spotted Nilo's goat running in the distance, but before they could pursue, the ants grew to enormous size upon contact with the magical substance, forcing the party to flee.\n\nDuring their pursuit, they encountered Landor and Goon, two others tracking the same creature. Despite their initial reluctance, the newcomers joined forces with the party. Their chase led them through increasingly dangerous territory, including a region of deadly poisonous plants where Nilo and Gio discovered rare materials. A mishap occurred when Goon's sneeze triggered the toxic flora, forcing another retreat.\n\nThe pursuit took another turn when they stumbled upon Laura Bush conversing with an unknown figure in Sylvan. The encounter ended in a massive explosion, leaving the party injured. Before fleeing, Laura Bush \"accidentally\" dropped a magical wand. Exhausted and damaged, the group pressed on rather than resting, entering an even more treacherous area where they encountered displacer beasts. The combination of toxic exposure and exhaustion led to violent hallucinations, ending with the party losing consciousness.\n\nThey awakened in a camp under the care of Zyrenia Serpentsoul, heir to the Serpentsoul clan. She took particular interest in Nilo, recognizing their shared condition—she, like him, possessed mixed blood, though in her case from her clan's practice of merging their bloodline with powerful serpent monsters. Her white hair marked her as exceptionally talented, though she too faced the challenges of not being pure-blooded. While tending to Nilo, she explained how she had witnessed them being defended by the goat during their unconscious encounters with various monsters. She requested that Nilo and Gio form a group with her younger brother, Vaelith Serpentsoul, a chosen one of their generation, for the upcoming Trial of Fire. The party left without committing to her request.\n\nThe chase culminated in a final encounter with the goat, where Landor and Goon were also present. Nilo finally managed to communicate with the creature, who explained its actions were driven by hunger and even offered to eat Thallassios—an offer Nilo declined. The goat then shed and regrew its horns, offering one to the party as proof of their completed quest.\n\nThe adventure took a dark turn when Nilo, confronted with a partially eaten boar carcass, experienced an overwhelming compulsion. To his companions' horror, he consumed the creature's heart, driven by an intrusive thought he couldn't resist. This act brought an unexpected revelation: the consumption satisfied a deep-seated hunger and bloodlust he had long struggled to control, suggesting a darker aspect to his nature."},{"path":"/Articles/Story Events/The Dark Sect Interns.md","content":"[[Phudara]]'s private meetings with the chosen ones unfolded with a peculiar mix of formality and awkward tension. She attempted to make each feel uniquely valuable, though her efforts at subtle manipulation often stumbled into transparent flattery. Each conversation came with an inheritance offer and an invitation to the dark sect, delivered with varying degrees of grace.\n\nHer discussion with [[Public/Articles/PCs/Laura Cassini|Laura]] about ocean travel meandered between practical advice and cryptic warnings. While insisting on the necessity of an [[Umberlee]] cleric for any serious voyage, she seemed oddly casual about the sea goddess's evil reputation, essentially suggesting that divine wrath was only a concern if one managed to specifically anger the deity. The advice, though valuable, left Laura with more worries than before.\n\n[[Nilo]]'s meeting centered on his aberrant [[dragonmark]], though [[Phudara]]'s limited knowledge became increasingly apparent as the conversation progressed. The revelation that his mark prevented nascent soul fruit formation led to an awkwardly presented choice between removal or suppression through her essence of life, with neither option seeming particularly appealing.\n\nThe encounter with [[Public/Articles/PCs/Herng Azurit|Herng]] took an unexpected turn into magical discipline, his previous allegiance to [[Marisella]] earning him a supernatural beating. His stubborn determination seemed to both irritate and impress [[Phudara]], though it didn't prevent her from simply declaring his earth inheritance without the pretense of choice she offered the others.\n\n[[Public/Articles/PCs/Thalassios Euphasath|Thalassios]]'s ambitious plans regarding [[Umberlee]] met with a mixture of cautionary tales and backhanded encouragement. While explaining the sea goddess's formidable position among god ghosts, [[Phudara]]'s mentions of internal disciples' ghost-fighting capabilities seemed to inadvertently fuel rather than dampen his resolve.\n\n[[Gio]]'s session devolved into a series of misunderstandings and clarifications about sect duties, with [[Phudara]] trying to downplay cosmic responsibilities while emphasizing local island matters. Her dismissal of his elder's divine wine recipe as mere deception led to an unexpected tangent about the isle of ghosts, which she suggested might be the legendary island of the end he sought—or perhaps not.\n\nWhen the group finally reconvened, their shared agreement to temporarily ally with the dark sect came with the collectively uncomfortable task of recruiting other chosen ones as external disciples. The awkwardness of their new role as sect recruiters was palpable, each processing their individual strange encounters with [[Phudara]] while contemplating how to approach their delicate new assignment."},{"path":"/Articles/Story Events/The Fateful eclipse.md","content":"# The Fateful eclipse\n\nThe scene opens with **[[Nilo]]**, bruised and groggy, awakening from the unconsciousness brought on by [[Umberlee|Emberlee]]'s punishment. As his vision clears, he realizes he’s not alone in the ship's hold. A young girl, with striking white hair and wearing the simple servant robes of the crew, stands nearby. Her expression is distant, emotionless. She introduces herself as **[[Ilmatera|Illira]]** and, much like [[Nilo]], her body bears the marks of past suffering. She quietly asks if [[Nilo]] is in pain, her words carrying an unspoken understanding. Their brief conversation offers [[Nilo]] a strange sense of comfort, a brief respite from his own torment. [[Ilmatera|Illira]] then tells him to come to the deck to witness the lunar eclipse that will take place tonight.\n\nWhen [[Nilo]] arrives on deck, the rest of the crew is already there, gathered around in hushed anticipation. **[[Satlypaws]]**, the ship's navigator, motions for everyone to extinguish the lights, so the full majesty of the moment can be felt. As the eclipse begins, the world is enveloped in a deep, unsettling darkness. The crew feels an unknown force pressing against them, followed by the eerie sensation of being watched. Unseen voices mutter in the shadows, accompanied by the chilling sound of something stabbing into the air.\n\nSuddenly, the darkness is broken as one of the crew members lights a torch, and in the dim glow, the body of **[[Thistle]]**, the ship’s navigator, is discovered. He has been brutally murdered before he could witness the breakthrough he worked so hard for. The crew, caught standing near the body, is swiftly blamed, and they are thrown into the ship's brig as the primary suspects in the murder.\n\nIn the cramped and tense confines of the jail, the main characters come together for the first time. They exchange introductions—**[[Gio]]**, **[[Public/Articles/PCs/Herng Azurit|Herng]]**, **[[Public/Articles/PCs/Laura Cassini|Laura]]**, **[[Nilo]]**, and **[[Public/Articles/PCs/Thalassios Euphasath|Thallassios]]**. It’s clear that no one trusts one another, and suspicion runs high. **[[Umberlee|Emberlee]]**, the quartermaster, demands that a culprit be found and executed, pushing the group to make a terrible choice: take the blame as a group, or sacrifice one among them.\n\n**[[Marisella]]**, the ship's healer, visits them in the brig, bringing food and water and offering comfort, but her words are as uncertain as the situation. **[[Public/Articles/PCs/Thalassios Euphasath|Thallassios]]**, a quiet and solemn figure, decides to sacrifice himself, feeling an inevitability to his fate. However, **[[Vexa]]**, who has been put in charge of the prosecution, reveals that **[[Umberlee|Emberlee]]** has taken a liking to [[Public/Articles/PCs/Thalassios Euphasath|Thallassios]] because of his fishing skills, so he would be spared. The group is left to choose someone else, a decision that weighs heavily on them all.\n"},{"path":"/Articles/Story Events/The Femcels.md","content":"## The Femcels\n\nSeeking additional resources, the party undertook a mining expedition to the volcano. After hours of exhausting work yielding only meager rewards, they decided to venture deeper into the volcano despite clear warning signs, hoping to find rarer materials.\n\nDeep within the volcanic caves, they stumbled upon a group of women performing a mysterious ritual—a combination of poison and fire methods designed to transform someone into a fire elemental. Most of the participants wore common robes, except for one figure in elegant black attire. Before the situation could be properly assessed, Thallassios impulsively attacked the group, transforming what could have been a rescue mission into a violent confrontation. Though the women were later confirmed to be Liberation Sect members, the initial attack led to tragic consequences.\n\nThe ensuing battle proved brutal. Pipkin, a kindly but heavyset follower, met a gruesome end when Thallassios forced her into the lava. Nilo struck down Lina, a young girl who showed no signs of being a cultivator. Two other members—Isolde, a wood cultivator, and Velira, a poison cultivator and the noblewoman in black robes—fought back fiercely. Their leader, Cinder, having partially completed the ritual, engaged the party as a half-formed fire elemental. Though Cinder was eventually defeated and surrendered alongside Isolde, Velira destroyed potential evidence before fleeing deeper into the volcano.\n\nLaura and Marisella, horrified by the unnecessary violence, confronted Thallassios about his rash behavior. As the party debated whether to use their captives to reach Korrin or turn them over to tribal justice—knowing either choice likely meant death or servitude for the women—they were interrupted by the arrival of Nerion Shadowflame, a young noble master searching for his sister, Velira.\n\nThe confrontation with Nerion proved tense, especially with his hidden adept-level escorts nearby. The party ultimately surrendered custody of their captives to Nerion's group, who continued deeper into the volcano in pursuit of Velira. After their departure, Marisella revealed crucial information about the Shadowflame clan: Velira had been stripped of her position as heir due to her inability to cultivate the clan's methods, replaced by her younger brother Nerion after the death of another heir in battle. Marisella also noted the captured women's unusual devotion to Korrin, suggesting they might be concealing deeper involvement with the Liberation Sect despite their apparent innocence."},{"path":"/Articles/Story Events/The First Session.md","content":"# The First Session\n\nSix months after setting sail, the crew of the expedition ship has settled into a rhythm, each member carving out their own role in the ongoing voyage. As the night of a rare astronomical event approaches, the crew's stories intertwine, revealing their strengths and flaws.\n\n**[[Public/Articles/PCs/Laura Cassini|Laura]]** and **[[Thistle]]** are in the cabin, discussing a celestial phenomenon set to occur that evening. If Thistle’s calculations are correct, the event could revolutionize their understanding of the stars. [[Public/Articles/PCs/Laura Cassini|Laura]] is filled with anticipation, knowing that this breakthrough could change everything, while [[Thistle]] remains absorbed in the math and figures, trusting that his theories will prove true.\n\nAbove on the deck, **[[Gio]]** rests against the railing, watching the sky and the antics of his fellow crew members. Nearby, **[[Sylva Windwhisper]]**, the aarakocra lookout, lazily ignores her post, instead fiddling with a piece of driftwood. **[[Silverscale]]**, the kobold sailmaster, is sprawled on a coil of rope, tossing wooden marbles in the air, utterly detached from the work at hand. [[Gio]] shakes his head with a wry smile—though they’re entertaining, their reluctance to carry out their duties often leaves him picking up the slack.\n\nAt the helm, **[[Public/Articles/PCs/Herng Azurit|Herng]]** stands beside **[[Grommash Thunderfist|Grommash]]**, the half-orc helmsman, who is more comfortable with the ship's course than any navigator should be. [[Grommash Thunderfist|Grommash]] admits to **[[Public/Articles/PCs/Herng Azurit|Herng]]** that he has no formal sailing experience. Instead, he navigates purely on instinct, convinced that his destiny guides him. [[Public/Articles/PCs/Herng Azurit|Herng]] listens quietly, understanding that, for all of [[Grommash Thunderfist|Grommash]]'s bravado, a deep unease lingers beneath his words. No one else on the crew seems to question the captain’s confidence, but [[Public/Articles/PCs/Herng Azurit|Herng]] knows better than most that blind trust can lead to dangerous outcomes.\n\nIn the lower decks, **[[Nilo]]** attempts to clean one of the ship's cannons under the direction of **[[Vexa]]**, the red tiefling gunner. Vexa, who’s more focused on shifting responsibility than learning her craft, orders [[Nilo]] to handle the task. But things go awry as [[Nilo]] mishandles the cannon, resulting in an explosion that could have been catastrophic. **Emberlee**, the elven strict quartermaster, appears almost immediately, punishing [[Nilo]] for the mistake, as she always does, with a swift and harsh reprimand. The crew knows that Emberlee’s punishments are as much a part of ship life as the salt air and the waves, but that doesn’t make them any less painful.\n\nElsewhere, **[[Private/Primal Era Campaign/Private/PCs/Thalassios Euphasath|Thallassios]]** finds himself caught by the fishermen as the crew's suspicions grow. His intentions remain unclear, and the tension surrounding his presence builds. After some questioning, **[[Umberlee|Emberlee]]** grudgingly allows him to stay on board, though it’s clear that his inclusion in the expedition is not without its risks.\n\nAs the crew prepares for the night’s event, the undercurrents of ambition, fear, and uncertainty ripple through the ship. No one knows what lies ahead, but each crew member plays their part—whether out of duty, destiny, or sheer force of will. The night promises a pivotal moment for the crew, and the stars themselves may offer the answers to questions they haven’t even begun to ask."},{"path":"/Articles/Story Events/The First Stage.md","content":"# The First Stage\n## The Elemental Chaos\n\nThe trial's first phase challenged initiates to navigate through a barrier into a wood path world, one of the nine great essences. Chaos erupted immediately when a massive explosion within the Lluvia tribe killed a dozen members and wounded many more. As the groups fought and gathered essences, several significant events unfolded:\n\n- Thallassios acquired a powerful lightning element, disrupting a battle between Quill Rest and Laura Bush\n- Nilo, Gio, and Lime confronted Velira's group, which included Tiberon, ultimately capturing Velira alive\n- The espora trio narrowly survived a devastating explosion of nine essences, saved only by Lime's powerful fate\n- A mysterious creature absorbed several participants, including Auron and members of the Liberation Sect, though the Nilo, Gio and Lime managed to escape. They left those behind to their own fate.\n- Herng, Marisella, and Rachel eventually reunited with Nilo's group and teleported together\n- Laura, Thallassios, and Lumina, severely injured after helping fight Velira and Tiberious, were forced to leave this phase early\n"},{"path":"/Articles/Story Events/The Ghosts of the Sea.md","content":"Before they can make their choice, a terrible crisis strikes. The ship is attacked by an **abyssal kraken**, its monstrous tentacles rising from the depths of the ocean, attempting to crush the ship and drag the crew down into the dark waters. Chaos erupts on deck. [[Vexa]], restrained by the crew, struggles against her bonds as the group fights to survive. **[[Marisella]]**, in a rare moment of defiance against the sea’s gods, prays fervently to **[[Lathender]]**, asking for blessings in the face of the oncoming storm. The crew watches helplessly as **[[Satlypaws]]** is pulled under by one of the kraken’s tentacles, his screams swallowed by the abyss.\n\nAmidst the chaos, **[[Public/Articles/PCs/Thalassios Euphasath|Thallassios]]** dives into the fray, using his aquatic prowess to save several crew members who have fallen overboard. Meanwhile, **[[Rudy Blagsta]]**, the hobgoblin leader of the fishermen, is flung from the deck by a lashing tentacle and barely manages to grab hold of a rope on the ship's outer hull. As he hangs precariously above the churning waves, **[[Gio]]** spots him through the storm. With an impressive display of strength and precision, **[[Gio]]** hauls **[[Rudy]]** back aboard, saving his life just as the ship creaks ominously under the kraken’s relentless assault. A shaken but grateful **Rudy** nods in silent thanks before retreating to help others.\n\nThe ship buckles further, and the crew attempts to abandon ship, but the situation worsens. **[[Vexa]]** is thrown into the ocean, dragged away by one of the kraken's appendages. The crew is scattered in the chaos, and **[[Nilo]]**, following close behind, notices **[[Ilmatera|Illira]]** is still by his side. They descend to the lower decks, where they discover the body of **[[Umberlee|Emberlee]]**, her form oddly serene in death. **[[Nilo]]**, driven by his hatred for the quartermaster, stabs her in the throat with a knife, seeking some twisted form of catharsis. But something feels off. **[[Umberlee|Emberlee]]**, is carrying strange magic items—among them a ring that refuses to come off, no matter how hard **[[Nilo]]** tugs.\n\nAs [[Nilo]] finally manages to remove the ring, he is horrified to see **[[Umberlee|Emberlee]]'s** eyes snap open, her gaze unblinking, filled with malice. In a panic, he places the ring back, only to realize that **[[Umberlee|Emberlee]]** is not truly dead—she is **[[Umberlee|Emberlee]]**, the goddess of the sea. The revelation shakes [[Nilo]] to his core, and in the moment of her awakening, the kraken retreats in terror, sensing the presence of the goddess.\n\n[[Ilmatera|Illira]], standing by [[Nilo]], reveals that she is not just any girl—she is **[[Ilmatera]]**, the goddess of martyrdom. In that moment, a fierce, divine battle erupts between the two goddesses, **[[Umberlee]]** trying to tear down the ship, while **[[Ilmatera]]** desperately protects it. Despite her efforts, [[Ilmatera]] is at a disadvantage, though she manages to seize something from **[[Umberlee]]'s** corpse: a **bag of holding**. She hands it to the crew, offering them the chance to fight back.\n\nInside the bag are powerful artifacts, but the crew struggles to understand their purpose. They retrieve a skull with a faint green hue, and upon activating its powers, nothing seems to happen—until, by chance, **[[Gio]]**, with his infamous luck, discovers a **Ring of Wishes** hidden among the items. With a single wish, **[[Gio]]** asks for the ship’s safety, and the **genie** in the ring responds, scattering the magical items across the sea to delay **[[Umberlee]]** and buy the crew precious time.\n\nNow, with the kraken momentarily distracted, the crew faces a race to find land— In **[[Amaterra]]**, the gods cannot tread the land. **[[Public/Articles/PCs/Herng Azurit|Herng]]** and **[[Public/Articles/PCs/Laura Cassini|Laura]]** work together to triangulate their position by the stars, using a star map artifact. Their search is guided by a final act of sacrifice: **[[Thistle]]'s** essence, taken from his corpse, is used to complete the map. As the crew sails toward the unknown, the weight of their choices and the true nature of the gods they’ve encountered will shape their fate in the days ahead."},{"path":"/Articles/Story Events/The Guardian of the Forest.md","content":"## The Guardian of the Forest\n\nThe presence of Mu Youqing and his guardian beast Xiaobao had become an insurmountable barrier to the trial's third stage. These powerful entities had systematically prevented any advancement, forcing Korrin and the Liberation Sect to organize a collective resistance. They gathered all available cultivators, calling for group representatives to devise a strategy against the nascent soul realm master.\n\nThe initial plan seemed sound—send a select team backed by two adepts to engage Xiaobao separately, allowing them an easier path to the third stage once the signal was given. They might even defeat the guardian beast if fortune favored them. Laura, speaking for her group, advocated for taking this seemingly safer route. However, Korrin had other plans, specifically requesting Thallassios's participation in the main battle, citing the powerful weapons in his possession. True to his nature, Thallassios agreed without hesitation, unknowingly binding his companions' fates to his decision.\n\nThe strategy session that followed produced an intricate plan involving multiple spell formations and the distribution of powerful magical potions to key participants. Thallassios would receive layers of magical enhancement, positioning him as the spear's tip in their offensive against the guardian. The weight of responsibility settled heavily upon him, though he seemed oblivious to its true magnitude.\n\nAfter the general meeting, Korrin extended a private invitation to Nilo and Gio, offering them positions among his chosen echelons within the sect. They received his offer with measured consideration, expressing a desire to consult their masters about such a significant commitment.\n\nThat night, Lime paid another visit to Nilo, her cynicism regarding the upcoming confrontation evident in her words. She specifically questioned Thallassios's chances of survival in his appointed role, suggesting darker motivations behind his selection. Despite her skepticism, she expressed curiosity about Korrin's apparent confidence. Her parting words to Nilo carried both warning and invitation—safety, she implied, lay at her side.\n\nMeanwhile, Selune reached out to Thallassios through Frostreaver, requesting a private audience. In the seclusion of a separate room, her illusory form materialized, heavy with concern. She warned him plainly of the vast power gap between him and their nascent soul realm opponent, but found his resolve unshakeable. Accepting his decision, she offered one final blessing through an intimate dual cultivation session. Though Thallassios could only endure two rounds, insufficient for a breakthrough, the experience forged a deeper bond between them."},{"path":"/Articles/Story Events/The Incels.md","content":"## The Incels\n\nDesperate for gold and resources to repair their ship, the party takes on various missions across the tribes. One mission involves rescuing dozens of missing members reported near the Aquagloom Abyss. Marisella and Rudy, busy with other tasks, stay behind as the rest of the group prepares for the underwater dive.\n\nAt the dungeon’s entrance, the party spots a rare Crystalfin worth hundreds of gold and decides to hunt it. The creature leads them to a bottle guarded in its nest, containing a plea for help. The message reveals that the victims are hiding in a secret cave outside the Abyss. They follow the lead, finding a massive, ancient entrance concealed by underwater vegetation. Inside, they discover a draconic inscription on the stone mechanism, which they brute-force open.\n\nThe cave system beyond is vast and intricate, its first chamber occupied by giant frogs. Attempting communication, the frogs reveal they ate \"weird food\" recently and lament their hunger. Leaving the frogs behind, the party ventures deeper, hearing muttering footsteps. They encounter Elandor, a nervous lackey, speaking of Korrin supervising \"experiments on the female suspects.\" Quick-thinking Laura disguises herself as a man with mud, convincing Elandor they’ve been sent by Korrin on behalf of the _Liberation Sect_.\n\nAs Elandor naively guides them further, a creature erupts from a hot crater, filling the room with scalding fog. The fire serpent’s core and fire gland become the party’s prize after an intense battle. Amid the chaos, a harpy emerges, having narrowly escaped being eaten by the frogs. Her sudden appearance terrifies Elandor, who mistakes her for a spy from the Lluvia tribe and tries to flee. The party captures him, noting a dark magical tart in his possession.\n\nThey press on and discover a horrifying scene: a higher chamber where female cultivators from the Lluvia tribe are held captive, malnourished, and tortured. Herng transforms into a centipede to scout, uncovering that the captors are male deserters from the tribe. These men plan to cement their rebellion with a breakthrough—one of them, Tiberon Grassetto, is on the verge of reaching the Adept Foundation level.\n\nThe captors, calling themselves the _Liberation Sect_, are a bitter group cultivating essences stolen from other tribes. Each harbors deep resentment for the Lluvia tribe's matriarchal structure:\n\n- **Grimmy**, a metal cultivator, is a goofy but skilled fighter who denounces the hypocrisy of their oppression.\n- **Sylas**, a druid, was exploited by the tribe as a male “vessel” to sire stronger offspring.\n- **Auron**, a pretty boy and fire cultivator, scarred himself to escape his former identity. He remains mute, determined to “change his fate.”\n- **Dexter**, a wizard of acid, broke under family pressure and fled from his overachieving sister’s shadow.\n- **Tiberon**, a former fisher guild higher-up, is the ambitious group leader of their rebellion.\n\nThe party strikes first, overwhelming the sect members with their superior coordination and raw power. The sect struggles to match their ferocity, and for a moment, it seems victory is within reach. However, Grimmy, fueled by desperation and the camaraderie he shares with his brothers, lands a lucky and devastating blow on Herng, disrupting his concentration.\n\nWith the party momentarily shaken, Tiberon completes his breakthrough and unleashes an Adept-level technique slapping Nilo to unconciousness. Thallassios, blinded by overconfidence and unwilling to retreat, challenges Tiberon head-on. His refusal to back down leads to disaster, as Tiberon counters with overwhelming force, knocking Thallassios and several others unconscious.\n\nLaura, the only party member still conscious, drags Gio and Thallassios to safety through the sandstorm caused by Tiberon’s technique. Seemingly forced to make a split-second decision, she leaves Herng behind, believing him lost. As Laura struggles to move the injured, Nilo miraculously awakens from unconsciousness and casts _Fog Cloud_, providing cover to their retreat.\n\nDespite their injuries, Laura and Nilo pursue the escaping sect at a distance. The _Liberation Sect_, driven by their unbreakable camaraderie, refuses to abandon one another. Dexter, realizing his brothers cannot escape in time, sacrifices himself, using his acid magic to create a barrier and push his unconscious comrades to safety. The scene is one of heartbreak and defiance as the sect narrowly escapes, with Dexter staying behind to face capture.\n\nBack at Herng’s body, Harpy mourns his apparent death. Believing him “too hungry to wake up,” she offers him the magical tart. In truth, the tart is a pact, granting Herng a second chance at life in exchange for becoming the harpy’s champion. Herng accepts, consuming the tart. His charisma surges to extraordinary levels, but at the cost of losing some of his hit dice permanently.\n\nThe party, unaware of the tart’s true nature, assumes it simply revived Herng. For now, they regroup, nursing their wounds and reflecting on the sect’s unusual strength and unshakable loyalty.\n"},{"path":"/Articles/Story Events/The Isle of Whispers.md","content":"After surviving the devastating ordeal of [[The Ghosts of the Sea]], the crew finds themselves stranded on the shores of an unknown island. The [[Fulh'ulbrech]], battered and barely afloat, limps onto land. Before disembarking, the survivors assess the state of the crew—only a dozen remain alive out of the hundred that had originally set sail. Among the fallen is [[Griznak]], the ship’s second-in-command, whose lifeless body lies in the lower deck. Venturing to the hold, they find [[Durim Stonehammer]], his eyes bloodshot and his hands trembling, tirelessly working to repair what remains of the ship despite being drenched in blood.\n\nAs the group regroups, [[Nilo]] returns from scavenging the wreckage with a strange revelation: a pristine, white-furred [[The Goat|goat]] had been feasting on the dead bodies near the wreck. Unsettled by this discovery, the crew follows him to inspect the animal. Upon closer examination, they find the [[The Goat|goat]] calm and silent, but unnervingly unnatural. Its teeth are sharp, jagged, and unmistakably carnivorous. Despite its grotesque behavior, the goat does not react aggressively to the crew. Instead, it stares intently at [[Nilo]] and begins following him, its presence becoming an unnerving shadow.\n\nAs the crew discusses what to do next, they are approached by a small figure that seemingly appears out of nowhere. The creature is unlike anything they have ever seen—small and fey-like, with vibrant green hair and an unsettlingly dark complexion. She introduces herself as [[Harpy]], a name that strikes an odd contrast with her innocent yet eerie appearance. [[Harpy]] explains, with an air of irritated resignation, that since the crash of their ship destroyed her “entire family,” she has no choice but to accept them as her new masters.\n\nThe crew is baffled by her words, but what truly unsettles them is [[Harpy]]’s very existence. In the world of [[Amaterra]], fey creatures like her are unheard of. They exist in neither legend nor historical record, and her presence defies any natural understanding of the world.\n\nAs the group ventures beyond the crash site, they are greeted by the island’s inhabitants—a group of humanoids who seem both cautious and reverent. The locals mistake the crew for immortals, divine beings descended from the heavens. This misunderstanding is rooted in the crew’s unusual arrival and the awe-inspiring destruction wrought by the crash. Despite the crew’s attempts to correct them, the islanders remain insistent, addressing them with reverence and asking if they are messengers of venerable immortals.\n\nThe islanders introduce themselves as members of three great tribes:\n\nThe [[Tribe Lluvia]], whose members are closely tied to water and rain,\n\nThe [[Tribe Llamarada]], fierce warriors aligned with fire and ash, and\n\nThe [[Tribe Espora]], a secretive group deeply connected to nature and growth.\n\n\nThe tribes invite the crew to learn their ways and explore the island. However, the tribes soon ask something more of them: to align themselves with one of the tribes as external representatives. This decision will shape the crew’s influence on the [[Isle of Whispers]] and the dynamics of their survival.\n\nMeanwhile, the strange [[The Goat|goat]] continues to follow [[Nilo]], its silent, predatory presence adding an air of unease. [[Harpy]]’s enigmatic smile and cryptic remarks only deepen the mysteries of the island and its strange inhabitants.\n\n\n\n"},{"path":"/Articles/Story Events/The Opening Ceremony.md","content":"## The Opening Ceremony\n\nThe eyes of the island's cultivation world focused on the gathering for the Trial of Fire. What began as a standard ceremony took an unexpected turn when the Lluvia Tribe made a shocking announcement: they would offer monetary rewards for the heads of rival tribe members. The other two tribes responded in kind, transforming the trial into a potential bloodbath. Gio's taunting of the Lluvia tribe resulted in a tenfold increase in the bounty on both his and Nilo's heads.\n\nBefore the ceremony's conclusion, an unusual event occurred when Nilo, Gio, Herng and the missing Thallassios and Laura were suddenly pulled into the air. Herng quickly reminded Harpy about their need for groups, leading to the hasty inclusion of Marisella, Rachel, Lime, and the surprised Lumina. Meanwhile, the competition's dynamics shifted dramatically with the unexpected entry of the Liberation Sect, adding a fourth faction of 100 initiates to the existing 300."},{"path":"/Articles/Story Events/The Second Visit to the Aquagloom Abyss.md","content":"# The Second Visit to the Aquagloom Abyss\n\nThe party of six ventured deep into the Aquagloom Abyss, guided by Thallassios's mysterious connection to voices calling from its depths. Their first night of camp was disrupted by an attack from pistol shrimps led by Tony \"Snapper\" Lobsterini, who after the skirmish attempted to recruit them into a war against Tommy \"Hammer\" Mantis's punch shrimps. Despite the offer of electrum, the party remained neutral in this underwater gang conflict.\n\nDescending to the second layer, they chose the middle path of three, discovering ancient ruins of a sea goddess's church. There, they encountered a group of sirens led by Umberlith, alongside her sisters Cassandra, Cerys, Velary, and Nyxara. The meeting quickly turned hostile when the sirens, followers of Emberlee, were overwhelmed by an inexplicable urge to attack Nilo. After a fierce battle that nearly claimed Nilo's life, they defeated Umberlith, ending the conflict. The sirens explained their centuries-long existence, sustained by a powerful deva corpse through cycles of death and rebirth. The goat, excited by this discovery, began consuming the deva's remains, unleashing powerful curses that forced everyone to evacuate, leaving only the unconscious Umberlith behind.\n\nBewildered and cursed, the party and the remaining sirens explored further into the abyss, eventually becoming lost in a vast, eerily peaceful region. Seeking guidance, Herng contacted Harpy, who provided specific coordinates and explicitly ordered them to wait there for her assistance. However, upon reaching the location and discovering a massive vortex, the party made the fateful decision to jump in rather than wait as instructed. This choice split the group tragically apart. Cassandra perished first, while Nilo, Gio, Lime, and Velarya struggled for survival on one side. Nilo fell unconscious but was saved by consuming a siren's heart, with Lime later refining another siren's remains into a nourishing pill. This group later encountered a wind path martial artist's inheritance trial, which proved too challenging, forcing them to promise a future return.\n\nLaura's group faced a different fate, as she, Cerys, and Nyxara were dragged through treacherous currents for days. Swallowed by a whale, they lost Cerys to exhaustion. Laura and Nyxara found themselves on a strange tropical island with an alien sky, where they discovered another siren's corpse—Seo Nari—revealing a political assassination that Nyxara vowed to avenge. Laura spent what felt like a year on the island before being suddenly teleported back for the Trial of Fire.\n\nHerng, separated from the others, was retrieved by Harpy, who questioned the party's decision to enter the vortex rather than wait for her aid. With the Trial of Fire approaching, the survivors rushed to address their accumulated curses. Nilo and Gio received treatment from Vanya, while Herng paid a hefty sum to the Shadowflame clan matriarch, Talia, who requested he watch over her son Nerion during the trial.\n"},{"path":"/Articles/Story Events/The Strange Thief.md","content":"## The Strange Thief\n\nWhile the goat announced its departure to handle \"business\" in the Lluvia tribe, a concerned Nilo and Gio pursued it, arriving too late to prevent what was to come. Meanwhile, Laura was discussing with Faelara about a series of mysterious thefts plaguing the tribe, with magical items and materials vanishing from their stocks. Faelara directed Laura to pay respects to the paintings of previous wind pillars, expensive works gifted by a talented wooden path artist.\n\nLaura's inspection revealed something unusual—one painting was covered in ants. Following the trail, she discovered the painting was a fake, only to be confronted by Galea, a senior sister who warned her away from the investigation. The arrival of Nilo and Gio interrupted their tense exchange, with Galea departing after casting verbal barbs at the newcomers.\n\nThe investigation expanded as they enlisted Lumina's help. They learned that even Lady Elowen had been affected by the thefts, finding her in a rage and threatening her servant Fin, who joined their search to clear his name. The group identified several suspects: Jin, a crippled former master; Kin, a young merchant; Min, a quiet fisherman; and Lin, a herbalist. During their investigation, Laura purchased a Silverthorn flower from Lin's shop as a cover, later giving it to Nilo to maintain appearances.\n\nFollowing the goat's trail led them to Kin, whose house reeked of disenchantment materials. There, they discovered Elandor's involvement. In the ensuing confrontation, a series of catastrophic mishaps left Nilo severely injured and poisoned, with Elandor being forcefully propelled away by the goat's intervention.\n\nRather than pursue Elandor, the group made a shocking discovery: the goat had orchestrated a vast network of nearly a hundred mortals to steal powerful artifacts and rare materials. Faced with the likelihood that the true culprits would face execution to appease public outrage, they made a morally questionable decision. They chose to frame Jin, whose position as a former master made her a believable scapegoat. With the goat's assistance, they altered memories to fabricate a confrontation and capture. Laura, disturbed by this decision, requested to be excluded from the deception.\n\nIn an unexpected turn of events, all the mortals the goat had recruited for its theft network ultimately joined the crew of the Fulh'ulbrech, finding a new purpose and refuge from their past activities. This addition significantly expanded the ship's crew, though the moral implications of their collective deception would continue to weigh on some of the party members."},{"path":"/Articles/Story Events/The Surgery.md","content":"## The Surgery\n\nAs preparations for the desperate procedure began, Wang Dabao surprised everyone by bringing in an unexpected ally—Velira Shadowflame. The female bard's presence was met with mixed reactions, but her ability to provide inspiration through her arts could prove invaluable. She acknowledged the group with a silent nod, her reluctance evident; she was there solely for Marisella's sake, viewing the rest as necessary inconveniences.\n\nThe operation would require perfect harmony of the five elements, with Nilo, Gio, Laura, Thallassios, and Lime serving as the primary surgeons. Lumina took up a supporting role, her divination abilities ready to twist fate in their favor—though fortune seemed to frown upon them that day. Their resources were limited: a handful of healing potions and materials that would have to suffice for both procedures.\n\nThey began with Marisella, whose condition was most severe, requiring reconstruction of all five yin organs. The gravity of their task hung heavy in the air as they started with the heart, channeling fire essence in a procedure that nearly claimed her life. The kidney reconstruction came next, utilizing water essence, but they managed to restore only one of the pair. The spleen followed, requiring careful manipulation of earth essence, again achieving only partial success. The liver procedure, guided by wood essence, yielded similar results—functional, but not optimal. Finally, they reached the lungs, where metal essence flowed through their efforts, and at last, they achieved a complete success.\n\nWang Dabao poured his heart into his performance, using every ounce of his inspirational ability to support Marisella's procedure. Velira, more conservative in her efforts, reserved most of her energy, offering only a single inspiration for Herng's upcoming surgery.\n\nHerng's procedure, though equally delicate, benefited from their newly gained experience. With three organs requiring attention—lungs, kidneys, and liver—they worked with greater confidence despite their dwindling resources. The difference showed in the results; each organ was restored to full functionality, a marked improvement over their earlier attempts.\n\nEight exhausting hours after they began, the procedures were complete. Their patients lay unconscious, still trapped between life and death by the curse that had claimed them, but their bodies were whole again. Now came another test of patience: waiting for the curse to fade and for their companions to wake, hoping their desperate gambit would prove successful.\n\nThe surgeons, drained both physically and mentally, could only watch and wait, their own recovery secondary to monitoring their patients' vital signs. In the quiet aftermath, the weight of what they had accomplished—and what might still go wrong—settled over the room like a heavy shroud."},{"path":"/Articles/Story Events/The Three Great Tribes.md","content":"The inhabitants of the island are all elves, divided into three tribes, each with distinct characteristics, practices, and specializations. The party splits up to explore and interact with each tribe, uncovering their secrets and unique dynamics."},{"path":"/Articles/Story Events/The Treant Battle.md","content":"## The Treant Battle\n\nFollowing traces of blood and sounds of combat, the party discovered their companions—[[Marisella]], [[Rachel Darm]], [[Laura Bush]], [[Quill Rest]], [[Lumina]], [[Wang Dabao]], and [[Lime]]—locked in an intense battle with a massive treant. The chamber presented a gruesome scene - the floor was strewn with countless corpses, victims of a massacre that had claimed lives from both the three great tribes and the liberation sect. It became clear that [[Sylas]], in his transformed state, had slaughtered many of his own sect members as well as members of the great tribes before the party's arrival. At the room's center, a spiritual pool pulsed with magical energy, feeding the treant's strength and sustaining the horror of the ongoing carnage.\n\nWithin the treant's form, they recognized Elder Brother [[Sylas]] of the liberation sect, partially transformed by one of [[Mu Youqing]]'s puppets. Despite Sylas's resistance to the transformation, the treant continued to heal itself by drawing power from the spiritual pool. The party's arrival turned the tide of battle, though they had to exercise caution to avoid harming [[Sylas]], whom they needed to control the inheritance. Though they succeeded in defeating the treant, [[Sylas]] was gravely wounded, requiring the use of their last Tear of Crystalina to save his life.\n\nIn the battle's aftermath, [[Wang Dabao]] approached [[Nilo]] with concerns about his association with [[Lime]], offering to introduce him to [[Velira]]'s supposedly less dangerous friends. [[Nilo]]'s response—a blood-stained smile carrying a hint of murderous intent—quickly ended the conversation, with [[Wang Dabao|Wang]] hastily apologizing to [[Public/Articles/PCs/Laura Cassini|Laura]] and returning her flying broom.\n\n[[Laura Bush]] broke the ensuing silence with crucial revelations about the inheritance. She explained that the current trials represented only half of the true inheritance, with the island's blessing being the other crucial component. She recounted how 500 years ago, [[Mu Youqing]]'s attempt to share the inheritance by having everyone drink from it had ended in tragedy when [[Faelara]] took control, causing all who had partaken to wither away."},{"path":"/Articles/Story Events/The Truth of the Trials.md","content":"## The Truth of the Trials\n\nWhen questioned about the sequence of events, [[Marisella]] explained that she had first found [[Quill Rest|Quill]], [[Rachel Darm|Rachel]], and [[Laura Bush|Laura]], then later encountered [[Lumina]] and [[Wang Dabao|Wang]]. Upon reaching this chamber, they had discovered chaos already in progress, with Lime among those battling the treant. [[Lime]] tersely commented that she had been \"one step late to get to the lake.\"\n\nThe discussion then revealed the broader political implications of their situation. The powerful figures of the great tribes had carefully groomed this generation's chosen ones, all seeking the island's protection before its volcano's final activation. Speculation suggested that the island's will manifested as an intelligent entity running a secret organization, selecting trial winners who alone could transcend and leave the island.\n\n[[Quill Rest]], choosing to trust those who are believed to be the true \"chosen ones of the island\" among the crew, made the strategic decision to share his privileged knowledge. Though this meant compromising his own advantage in the trials, he revealed detailed information about their destination. His description of the location triggered immediate recognition among the group - particularly regarding a distinctive chamber they had notably avoided earlier in their exploration. However, before proceeding to this crucial location, the party, still mindful of their earlier precautions, decided to backtrack and verify that their hidden treasure remained secure under the protection of their alarm spell. Only then did they move forward to confront whatever awaited them in this mysterious chamber that seemed to hold such significance in the island's grand design."},{"path":"/Articles/Story Events/The World Expedition.md","content":"# The World Expedition\n\nThe story begins with an ambitious journey originating in [[Imia]]—a grand expedition to traverse all the lands of [[Amaterra]]. Central to this mission is the **[[Fulh'ulbrech]]**, a colossal sailing ship capable of housing a crew of 100–200 people. This monumental endeavor is funded by the wealthy magnate **[[ Eldon Deunwise ]]**, whose peculiar ambition is to make his beloved dog, **[[Saltypaws]]**, the first to \"conquer the oceans.\" To achieve this, [[Eldon Deunwise|Eldon]] recruited people from across **[[Imia]]**, **[[Yomel]]**, and **[[Okateira]]**, assembling a diverse and capable crew.\n\n---\n\n# The Main Characters\n\n(As they joined the expedition)\n\n**[[Laura Cassini]]**\n\n- **Age**: 21\n- **Race/Class**: Human Ranger\n- **Background**: Hailing from Imia, Laura bears the **Mark of Finding**, a dragonmark that aligns with her talent for exploration. She joined the expedition to search for her missing father, hoping to deliver the tragic news of her mother’s passing. Laura’s journey also stems from a desire to reconcile with her father, who left home years ago. She was recruited by **Navigator Thistle**, a cartographer and acquaintance of her father, who took her on as an apprentice.\n\n**[[Nilo]]**\n\n- **Age**: 17\n- **Race/Class**: Half-Elf Rogue\n- **Background**: A slave from Imia, Nilo bears an **Aberrant Dragonmark**, a cursed gift that makes his life even more precarious. His father vanished during the war, and his mother passed away when he was a child. Desperate for freedom, Nilo joined the expedition through a stroke of luck, though he remains bound as part of the ship’s servant crew. His hope is that traveling far from Imia will eventually lead to liberation.\n\n**[[Herng Azurit]]**\n\n- **Age**: 55\n- **Race/Class**: Dwarf Druid\n- **Background**: Originally from Yomel, Herng fled its hostile lands in search of peace and the pursuit of his passion—studying rocks. He joined the expedition alongside his unlikely companions, **Grommash Thunderfist** and **Gio**, after a mysterious figure known only as **Old Wang** suggested the idea in a tavern.\n\n**[[Gio]]**\n\n- **Age**: 25\n- **Race/Class**: Tortle Monk\n- **Background**: From the chaotic lands of Okateira, Gio left in search of ancestral glory, pursuing the promised “Divine Land of the End.” He managed to sneak aboard the **Fulh'ulbrech** with the help of **Grommash Thunderfist**, who, for reasons known only to himself, became the expedition’s helmsman.\n\n**[[Public/Articles/PCs/Thalassios Euphasath]]**\n\n- **Age**: 17\n- **Race/Class**: Triton Ranger\n- **Background**: A native of the ocean’s depths, Thallassios first spotted the **Fulh'ulbrech** as it passed above him, its massive wooden frame a wonder unlike anything he had ever seen. Captivated by the sight, he was accidentally caught by the ship’s fishermen. Deciding to join the expedition, Thallassios embarked on this new journey, eager to explore the surface world."},{"path":"/Articles/Things/Fulh'ulbrech.md","content":"This colossal sailing vessel pushes the boundaries of shipbuilding, designed to house between 100-200 crew members comfortably. Known for its unique construction, the ship represents a collaborative achievement where numerous architects, craftsmen, and visionaries pooled their expertise. Multiple decks serve various functions, from living quarters to specialized work areas, making it more akin to a floating city than a traditional vessel. The ship stands ready to begin its journey, carrying its diverse crew into adventures unknown."},{"path":"/Articles/World Lore/Amaterra.md","content":"Amaterra is the world where Campaigns I and II take place. It is also the name of the dragon who created this planet. Amaterra divided herself into three aspects to nurture the world and make it a home for her draconic kin."},{"path":"/Articles/World Lore/Continents/Aildrieg.md","content":"Aildries is a continent under the watchful eye of its silver dragon goddess, a benevolent ruler who prioritizes the advancement of arcane knowledge among her people. Under her guidance, the continent has become the world's foremost center of magical learning.\n\nThe landscape is dotted with grand academies and towers of magical study, where wizards from across the globe come to deepen their understanding of the arcane arts. These institutions have produced the most powerful spellcasters known to exist, their expertise unmatched in any other realm."},{"path":"/Articles/World Lore/Continents/Imia.md","content":"According to legend, the mountains of this continent were created and sculpted by the diamond dragon god, Imia. These mountains have peculiar shapes and are rich with precious minerals, a gift from the creator dragon god to the inhabitants of this land. It is said that the World Tree found here is the tomb of Imia, giving life to the entire continent.\n\nImia is a vast continent with an immense population of non-dragons. Most people live their lives unaware of the ongoing conflict among their true lords. In fact, the majority of villages believe that magic is a myth and that dragons are nothing more than legends or part of a reptilian conspiracy theory.\n\nThe inhabitants of these lands are caught in constant political conflicts and rivalries between feudal landowners, which are, in reality, games played to resolve disputes among dragons. These dragons, though numerous, live secretly among the people.\n\nThose who are aware of this truth bear [[Dragonmark |dragonmarks]] on their bodies, signs of their knowledge and connection to the hidden reality of this mysterious world."},{"path":"/Articles/World Lore/Continents/Leatrux.md","content":"Leatrux stands as a sanctuary continent, named after its platinum dragon god who serves as a benevolent protector rather than a ruler. This land has become a haven for those seeking refuge from the conflicts that plague other realms, its shores welcoming those who have lost their homes to countless wars. Unlike other continents where dragons hold sway in numbers, Leatrux is unique in that its guardian deity stands alone - no other dragons make their home in these lands. \n\nWhat makes this realm truly remarkable is its religious freedom. While other continents might demand devotion to their dragon gods, Leatrux the Platinum Dragon has done something unprecedented - allowing people to freely practice their own faiths and maintain their cultural traditions. "},{"path":"/Articles/World Lore/Continents/Okateira.md","content":"This is a continent inhabited primarily by humanoid animals, where different species live in segregated tribes. Prejudice, racism and xenophobia runs deep here between species. These tribes don't get along and are frequently in conflict with each other.\n\nAccording to legends, great wars were fought to gain the favor of dragons. In these lands, the fiercest warriors earn dragon approval, which means not just survival, but also resources and pride.\n\nThe dragon god of this continent is Okateira, a mercury dragon whose nature is completely bizarre and chaotic. This dragon is said to have two heads that are constantly in conflict with each other. The dragon favors animals over dragonborn and other species.\n\nThere are hundreds of stories about Okateira's unpredictable nature - one day performing miraculous healings and bestowing blessings, the next day consuming entire villages on a whim. Parents discipline their children by saying Okateira will appear and eat them if they misbehave.\n\n"},{"path":"/Articles/World Lore/Continents/Phudara.md","content":"Phudara is a mystical continent under the domain of the emerald dragon goddess, a realm shrouded in natural wonder and mystery. While the exact population remains unknown, what's truly remarkable about this land is its extraordinary ecosystem.\n\nThe forests of Phudara possess a magical vitality that surpasses even the legendary world trees found on other continents. Its wildlife exhibits enchanted properties unseen anywhere else - creatures that seem to blur the line between natural and magical beings, plants that pulse with arcane energy, and forests that appear to breathe with their own consciousness."},{"path":"/Articles/World Lore/Continents/Reonna.md","content":"Reonna stands as a remote and isolated continent, characterized by its vast seascapes and towering salt-encrusted peaks. Under the watch of its Yellow dragon goddess, this realm remains one of the world's most secluded territories.\n\nThe inhabitants of Reonna mirror their deity's reclusive nature. They are a people who have chosen isolation, neither venturing beyond their shores nor welcoming outsiders to their lands. Their society has developed in complete isolation, creating customs and traditions untouched by outside influence."},{"path":"/Articles/World Lore/Continents/Sirius.md","content":"Sirius is a vast expanse of ice and snow that has only recently been recognized as a continent, following the rise of its ambitious White dragon god. Unlike the established realms, this frozen territory is emerging as a new power, with its ruler setting sights beyond its frigid borders - particularly toward [[Aildrieg]] and its magical dominion.\n\nThe landscape is an endless vista of ice fields, glaciers, and frozen peaks, where the bitter cold shapes every aspect of existence. Few dare to make their home in such an unforgiving environment, making the population sparse and scattered. Those who do survive here have adapted to extreme conditions that would break most others."},{"path":"/Articles/World Lore/Continents/Yomel.md","content":"Yomel is the continent ruled by an arrogant blue dragon god who dwells in the highest mountains, far removed from civilization. He commands an army of dragons that control the continent and enslave its inhabitants as their workforce.\n\nThe environment of Yomel is harsh and resource-poor, with poverty widespread and survival a constant challenge. These conditions have forced its inhabitants to adapt, developing into one of the most unique and commercially advanced civilizations.\n\nMonsters and dangers lurk throughout the desert, making trade routes treacherous. Caravans require expert guides who understand the land to successfully transport goods. People aspire to join elite merchant guilds or become their mercenary protectors.\n\nDue to these harsh conditions, dark practices for survival have become common across the continent. Most try to form warlock pacts with dragons for power and protection. Those who cannot achieve such pacts turn to worshipping other hidden deities of the desert."},{"path":"/Articles/World Lore/Dragons/Dragonmark.md","content":"Dragonmarks are **_blessings_** bestowed by the origin dragons upon the common folk of [[Amaterra]]. While the world of [[Amaterra]] once housed an untold number of dragons, only 10 noble houses descended from them remain to this day. And they only reside in three of the continents of [[Amaterra]].\n\n## [[Yomel]]\n\n[[Yomel]], despite its harsh environment and oppressive blue dragon rule, hosts three noble houses of significant power.\n\n- **Mark of Storm (House Caelus)** - Given by a Blue Dragon. Blue dragons are fast and territorial, qualities that can be associated with the power of storms and weather manipulation.\n    - [Half-Elf Mark Of Storm](https://dnd5e.wikidot.com/lineage:half-elf-mark-of-storm)\n    - Cha, Dex\n- **Mark of Scribing (House Nigrum)** - Given by a Black Dragon. Black dragons are secretive and often associated with dark magic, which could tie into the mark of scribing and communication.\n    - [Gnome Mark Of Scribing](https://dnd5e.wikidot.com/lineage:gnome-mark-of-scribing)\n    - Cha +1\n- **Mark of Sentinel (House Ruber)** - Given by a Red Dragon. Steel dragons are guardians and protectors, making them ideal for a mark focused on protection and sentinel duties.\n    - [Human Mark Of Sentinel](https://dnd5e.wikidot.com/lineage:human-mark-of-sentinel)\n    - Con, Wis\n\n## [[Aildrieg]]\n\n[[Aildrieg]] the continent of magical learning, is home to four distinguished metallic houses.\n\n- **Mark of Detection (House Argento)** - Given by a Silver Dragon. Silver dragons are known for their wisdom, keen senses, and ability to detect threats.\n    - [Half-Elf Mark Of Detection](https://dnd5e.wikidot.com/lineage:half-elf-mark-of-detection)\n    - Wis, Con\n- **Mark of Healing (House Aureus)** - Given by a Gold Dragon. Gold dragons are benevolent and nurturing, making them fitting patrons for healing abilities.\n    - [Halfling Mark Of Healing](https://dnd5e.wikidot.com/lineage:halfling-mark-of-healing)\n    - Wis +1\n- **Mark of Hospitality (House Brassica)** - Given by a Brass Dragon. Brass dragons are sociable and enjoy company, making them perfect for a mark focused on hospitality and community.\n    - [Halfling Mark Of Hospitality](https://dnd5e.wikidot.com/lineage:halfling-mark-of-hospitality)\n    - Cha +1\n- **Mark of Making (House Ferrum)** - Given by a Bronze Dragon. Bronze dragons are skilled craftsmen and creators, aligning well with the mark of making.\n    - [Human Mark Of Making](https://dnd5e.wikidot.com/lineage:human-mark-of-making)\n    - Int +2, any ability score +1\n\n## [[Imia]]\n\nImia stands unique among the continents as a melting pot where all Dragonmarked houses gather to test their abilities, though it primarily houses three notable lineages.\n\n- **Mark of Warding (House Diamantus)** - Given by an Adamantine Dragon. Diamond dragons are known for their resilience and protective qualities, making them ideal for the mark of warding.\n    - [Dwarf Mark Of Warding](https://dnd5e.wikidot.com/lineage:dwarf-mark-of-warding)\n    - Int +1\n- **Mark of Handling (House Viridis)** - Given by a Green Dragon. Green dragons are cunning and manipulative, traits that could align with the ability to handle and control creatures.\n    - [Human Mark Of Handling](https://dnd5e.wikidot.com/lineage:human-mark-of-handling)\n    - Wis, Con\n- **Mark of Finding (House Aesio)** - Given by a Copper Dragon. Copper dragons are playful and curious, often known for their knack for finding hidden things and treasures.\n    - [Human Mark Of Finding](https://dnd5e.wikidot.com/lineage:human-mark-of-finding)\n    - Wis, Con\n"},{"path":"/Articles/World Lore/Record of the Isle's Honored One.md","content":"In the ten thousand years of this island's history, many have set their names in the records, honored and recognized by the island's will.\n## Latest Chosen of the Trials\nFrom 10,000 - 1,200 years ago:\n- All of the previous ones are either dead or have ascended the island.  \nFrom 1,200 years ago to present:\n- Wood: **[[Zarvon Fungart]]** _Sovereign of the Espora Tribe_\n- Fire: **[[Talon Scorch]]** _Supreme Elder of the Llamarada Tribe, former Patriarch_\n- Wind: **Zephyrus Cloudweaver** †\n- Lightning: **Lei Tian'zi** †\n- Water: **Aquarion Tidecaller** †\n- Poison: **[[Kazren Serpentsoul]]** _Patriarch of the Serpentsoul Clan and Master of the Espora Tribe_\n- Acid: **Corrodius Meltheart** †\n- Earth: **Gaeanor Darm** †\n- Metal: **Mythralion Silverweave** †\n- Wood: **[[Faelara Rest]]** _Supreme Elder of the Lluvia Tribe_\n- Fire: **[[Pyrenna Flamedancer]]** _Master of the LLamarada Tribe_\n- Wind: **Neraia Sunflare** †\n- Lightning: -\n- Water: **[[Shui Yuan'hua]]** _Adept of the Lluvia Tribe_\n- Poison: **Toxara Venomweave** †\n- Acid: **[[Fendral]]** _Adept of the Espora Tribe_\n- Earth: **[[Ren]]** _Formation Expert of the Liberation Sect of the Llamarada Tribe_\n- Metal: **[[Chromaela Ironheart]]** _Adept, Heir of the Ironheart Clan of the Llamarada Tribe_\n- Wood: **[[Lime]]** _Innocent girl of the Espora Tribe_\n\n\n## All Ascendants in History\nThroughout the island's history, exceptional individuals have emerged roughly once every half millennium. There hasn't been an ascendant since the catastrophe of the Storm Tribe.\n\n- **[[Wang Tian'bao]]** (~9,800 years ago) - The first to transcend, this whimsical master of Wind captured the voices of breezes in jade bottles. He'd show up uninvited to important meetings claiming he was \"just passing by,\" carried there by friendly winds.\n- **Toxaris Veilweaver** (~9,600 years ago) - This mysterious Poison master created gardens of beautiful decay. Strange as it sounds, he could safely taste any poison, keeping journals about their unique \"flavors\" and how they transformed the world.\n- **Feng Lei'yuan** (~9,200 years ago) - After spending 200 years in constant storms, this Lightning master either spoke ridiculously fast or painfully slow. Built a tower where storms never cease, inviting brave cultivators to meditate in pure chaos.\n- **Terrador Prime** (~8,800 years ago) - An Earth master who carried conversations with a collection of named pebbles from powerful places. Would casually bury himself alive for decades to \"learn the mountain's patience.\"\n- **Jin Dao'yi** (~8,400 years ago) - This Metal master insisted metals had memories and dreams. Would formally introduce new metal items to their collection and never work with gold before noon.\n- **Corrosivus Shine** (~7,900 years ago) - First to master two elements (Acid/Metal). Had thousands of experiments running simultaneously, some for centuries. Couldn't help but \"correct\" imperfect things around her.\n- **Aqua Ming'lei** (~7,200 years ago) - This Water/Lightning master collected water from meaningful moments - first rains, last drops of dying streams, tears of joy. Created storms for teaching, claiming magic should be beautiful.\n- **Sylvanis Heartwood** (~6,600 years ago) - This Wood master spoke so slowly - one word per season - that their sentences took years to complete. Could talk to plants but had to slow their thoughts to \"tree-time.\"\n- **Huo Ren'zhi** (~5,900 years ago) - A Fire/Earth master who wrote detailed tasting notes about different types of magma. Would reshape mountains when annoyed, leading to the saying \"don't make the mountain-maker angry.\"\n- **Venomancer Quan** (~5,100 years ago) - This Poison/Water master started each day drinking a small poison as their \"morning news.\" Created the Nine Springs of Purification, claiming poison and medicine were the same thing viewed differently.\n- **Storm Tian'feng** (~4,400 years ago) - A Lightning/Wind master who could exist in multiple places within their storms, teaching different aspects of the same technique simultaneously to confused students.\n- **Crystallis Shen'shi** (~3,800 years ago) - Created floating crystal palaces that doubled as cultivation chambers. This Earth/Metal master was so obsessed with symmetry that disciples couldn't tell if they were building or having a breakthrough.\n- **Wei Shadowflame** (~3,300 years ago) - A Fire/Poison master who \"painted\" with toxic flames, claiming to show \"reality's dreams.\" Had two distinct personalities: methodical researcher and passionate artist.\n- **[[Selune]]** (~2,900 years ago) - This Water master created conscious water clones for different aspects of her personality. Even other transcendents couldn't tell which was the original - she'd just smile and say \"Maybe I'm the clone.\"\n- **Arborus Leaf'qi** (~2,500 years ago) - A Wood/Wind master who spoke through growing plants rather than words. Created a garden where plants were frozen at different growth stages, making a living library.\n- **Metalborn Dao'jin** (~2,200 years ago) - Treated metal ores like children that needed education before forging. Spent decades \"raising\" single pieces of metal, claiming \"a blade must learn wisdom before it can learn sharpness.\"\n- **Acid Feng'hua** (~1,900 years ago) - An Acid/Wind master obsessed with finding the \"true form\" of everything through precise dissolution. Kept a vast collection of partially dissolved objects frozen at their \"moment of perfection.\"\n- **Pyralis Night'lei** (~1,700 years ago) - Fire/Lightning master who treated elements like music, conducting elaborate displays. Created eternal flame beacons that still burn today, each telling a different story through its patterns.\n- **Terra Yuan'shi** (~1,400 years ago) - Refused to travel above ground, this Earth master built vast tunnel networks following what they called \"the planet's meridians,\" popping up in unexpected places.\n- **Venom Lord Kai** (~1,200 years ago) - The last to ascend, this Poison/Metal master created the island's current defensive barriers by treating them like living things that needed to be \"vaccinated\" against different types of attacks."},{"path":"/Articles/World Lore/The Cosmology and Geography of Amaterra.md","content":"[[Amaterra]] is divided into eight main continents, each named after and ruled by its founding dragon. These dragons are:\n\n- **Leatrux**, the lawful platinum dragon\n- **Sirius**, the perseverant white dragon\n- **Phudara**, the cunning emerald dragon\n- **Okateira**, the chaotic mercury dragon\n- **Aildrieg**, the benevolent silver dragon\n- **Yomel**, the tyrant blue dragon\n- **Reonna**, the reclusive yellow dragon\n- **Imia**, the powerful adamantine dragon\n\nOver the course of history, these continents have shifted and changed—sometimes in shape, sometimes in rulers. Some continents have been created, while others have fallen into ruin. This ever-changing landscape makes traveling across the world a complex endeavor.\n\nAdditionally, because [[Amaterra]] is an exoplanet influenced by the pull of fate, it is not bound to a single solar system. It exists independently of any galaxy, and the forces from other systems can only momentarily affect its trajectory. No one knows the true direction in which Amaterra is heading.\n\nThis uncertainty extends to the starry sky above. It is constantly in flux, with the number of moons and suns varying over time. As a result, navigation is a constant challenge—calculations must be adjusted after each period as the sky and the planet itself change."},{"path":"/Articles/World Lore/The Isle of Whispers.md","content":"This hidden isle lies in the deep southern reaches of [[Phudara]]. In truth, it is an artificially segregated landmass, created by [[Phudara]], the emerald dragon. Long ago, she clashed with two powerful adversaries—[[Retharax]], the origin red dragon, and [[Vyrelaxan]], the origin green dragon. Outmatched and at a severe disadvantage, [[Phudara]] used her cunning to deceive her foes, managing to kill [[Vyrelaxan]] and seal [[Retharax]] on this very island.\n\nFor years, the world believed the conflict to be resolved, with [[Phudara]] retreating into deep seclusion. But in reality, the scheming and rivalry among these dragons are far from over. [[Retharax]] is slowly healing, plotting his escape and revenge. Meanwhile, [[Phudara]], still recovering from her own wounds, has taken every measure to prevent his return. She brought life to the island, populating it with elves who grew into thriving tribes. These tribes now compete with one another, cultivating the legacy of [[Amaterra]] under [[Phudara]]’s subtle influence, all as part of her long-term strategy to contain [[Retharax]] and uncover his plans.\n\nNow, [[Retharax]] is on the verge of awakening, and [[Vyrelaxan]]'s noble house has somehow managed to infiltrate the island from the outside. The machinations of these two dragons continue, their plots aimed at toppling [[Phudara]] and reclaiming what they believe is theirs."},{"path":"/Articles/World Lore/The Shadow Sect.md","content":"The origins of the Shadow Sect remain shrouded in mystery, but it is known to your a party that [[Phudara]] serves as the current acting leader of the sect on [[Amaterra]]. Their singular objective is monumental: to create a portal connecting the [[Feywild]] and [[Shadowfell]], thus bringing the laws of life and death to this world. By achieving this, they hope to save all the remnant souls trapped on [[Amaterra]], allowing them to rejoin the cycle of rebirth.\n\nAmong the sect's ranks is [[Harpy]], the self-proclaimed Saintess of the Shadow Sect. She oversees the island, ensuring the sect's objectives are advanced. All sect members hail from the [[Isle of Whispers]], chosen through the grueling Trial of Fires. Those who pass this test become \"seeds,\" earning the rank of external disciples. Only those who further prove themselves by earning [[Harpy]]'s approval can transcend the island and rise to the status of internal disciples.\n\nThese internal disciples journey across [[Amaterra]], undertaking various missions to advance the sect's ultimate goal. As the Shadow Sect grows in influence and power, its presence looms ever larger over the world, poised to shape the fate of [[Amaterra]] itself.\n\n\n"},{"path":"/Missing from summary.md","content":"\n- NPCs pages I guess.\n- Their short visit to the Venomshade Sanctum to go find the missing and forgotten Harpy.\n- The strength draining poison from the rescue mission.\n- Whenever the group goes to check on the survivors after they healed.\n- That time they interacted with Lady Elowen and offered gifts and a dinner.\n- That spirit spring healing day.\n- Gio changing colors every day."},{"path":"/Storyline.md","content":"- [[The World Expedition]]\n\t- [[The First Session]]\n\t- [[The Fateful eclipse]]\n\t- [[The Ghosts of the Sea]]\n- [[Public/Articles/Story Events/The Isle of Whispers]]\n\t- [[The Three Great Tribes]]\n\t\t- Tribe Lluvia\n\t\t\t- [[Introduction to Lluvia]]\n\t\t\t- [[Grommash’s Incident]]\n\t\t- Tribe Llamarada\n\t\t\t- [[Introduction to Llamarada]]\n\t\t\t- [[Nilo’s Nightmare and Marisella’s Dream]]\n\t\t- Tribe Espora\n\t\t\t- [[Introduction to Espora]]\n\t\t\t- [[Thallassios and Gio’s Experience]]\n\t- The Liberation Sect\n\t\t- [[A Rogue Fire-Poison Cultivator]]\n\t\t- [[The Incels]]\n\t\t\t- [[The Aftermath and Pure Ice Inheritance]]\n\t\t\t- [[Passing the News to the Three Great Tribes]]\n\t\t- [[The Femcels]]\n\t- The Strange Goat\n\t\t- [[The Chupacabra Incident]]\n\t\t- [[The Strange Thief]]\n\t- The Trial of Fire\n\t\t- [[Preparing for the Trial of Fire]]\n\t\t\t- [[The Second Visit to the Aquagloom Abyss]]\n\t\t- [[The Opening Ceremony]]\n\t\t- [[The First Stage]]\n\t\t- The Second Stage\n\t\t\t- [[Team Magma's Journey]]\n\t\t\t\t- [[Team Magma's Camp]]\n\t\t\t- [[Team Aqua's Journey]]\n\t\t\t\t- [[Team Aqua's Camp]]\n\t\t\t- [[Reuniting at the Liberation Sect Mansion]]\n\t\t\t\t- [[The Surgery]]\n\t\t\t\t- [[Korrin's Sincerity]]\n\t\t\t\t- [[Harpy's Sincerity]]\n\t\t\t- [[The Guardian of the Forest]]\n\t\t\t\t- [[Fighting the Guardian]]\n\t\t\t\t- [[Escaping to the Third Stage]]\n\t\t- The Third Stage\n\t\t\t- [[Aurelia, the Golden Temptress]]\n\t\t\t- The True Inheritance\n\t\t\t\t- [[First Half of the Inheritance]]\n\t\t\t\t\t- [[The Treant Battle]]\n\t\t\t\t\t- [[The Truth of the Trials]]\n\t\t\t\t- [[Second Half of the Inheritance]]\n\t\t\t\t\t- [[Harpy's Grievances]]\n\t\t\t\t\t- [[Meeting the Will of the Island]]\n\t\t\t\t\t- [[The Dark Sect Interns]]\n\t\t\t\t\t- [[Fighting Korrin I]]"}]